Repository: pypi-data/pypi-mirror-381
Catalog: packages/geomanager/geomanager-0.5.8-py3-none-any.whl/geomanager/locale/*/LC_MESSAGES/django.po
Languages: am, ar, es

source: Label
am: መለያ
ar: ملصق
es: Etiqueta

source: Page
am: ገጽ
ar: صفحة
es: Página

source: Internal page to navigate
am: ለማሰስ የውስጥ ገጽ
ar: الصفحة الداخلية للتنقل
es: Página interna para navegar

source: External Link
am: ውጫዊ አገናኝ
ar: رابط خارجي
es: Enlace externo

source: External link to navigate to. Used if internal page not provided
am: የሚሄድበት ውጫዊ አገናኝ። የውስጥ ገጽ ካልተሰጠ ጥቅም ላይ ይውላል
ar: رابط خارجي للانتقال إليه. يُستخدم في حالة عدم توفير الصفحة الداخلية
es: Enlace externo para navegar. Se utiliza si no se proporciona la página interna

source: Key
am: ቁልፍ
ar: مفتاح
es: Llave

source: Value
am: ዋጋ
ar: قيمة
es: Valor

source: Radio
am: ሬዲዮ
ar: مذياع

source: Dropdown
am: ዝቅ በል
ar: اسقاط
es: Desplegable

source: name
am: ስም
ar: اسم
es: nombre

source: label
am: መለያ
ar: ملصق
es: etiqueta

source: Selector Type
am: የመራጭ ዓይነት
ar: نوع المحدد
es: Tipo de selector

source: value
am: ዋጋ
ar: قيمة
es: valor

source: default
am: ነባሪ
ar: تقصير
es: por defecto

source: Check to make default option
am: ነባሪ አማራጭ ለማድረግ ያረጋግጡ
ar: تحقق لجعل الخيار الافتراضي
es: Marque para hacer la opción predeterminada

source: Options
am: አማራጮች
ar: خيارات
es: Opciones

source: Basic
am: መሰረታዊ
ar: أساسي
es: Básico

source: Gradient
am: ግራዲየንት
ar: الانحدار
es: Degradado

source: Choropleth
am: ቾሮፕሌት
ar: تشوروبليث
es: coropleta

source: Legend Type
am: አፈ ታሪክ አይነት
ar: نوع الأسطورة
es: Tipo de leyenda

source: Can be a number or text e.g '10' or '10-20' or 'Vegetation'
am: ቁጥር ወይም ጽሑፍ ለምሳሌ '10' ወይም '10-20' ወይም 'አትክልት' ሊሆን ይችላል
ar: يمكن أن يكون رقمًا أو نصًا، على سبيل المثال "10" أو "10-20" أو "الغطاء النباتي"
es: Puede ser un número o texto, por ejemplo, '10' o '10-20' o 'Vegetación'

source: color
am: ቀለም
ar: لون

source: Color value e.g rgb(73,73,73) or #494949
am: የቀለም እሴት ለምሳሌ rgb(73፣73፣73) ወይም #494949
ar: قيمة اللون، على سبيل المثال rgb(73,73,73) أو #494949
es: Valor de color, por ejemplo, rgb(73,73,73) o #494949

source: Legend Items
am: አፈ ታሪክ ዕቃዎች
ar: عناصر الأسطورة
es: Artículos de leyenda

source: Icon Image
am: አዶ ምስል
ar: صورة الرمز
es: Imagen del icono

source: Icon Label
am: የአዶ መለያ
ar: تسمية الرمز
es: Etiqueta de icono

source: Icon color
am: የአዶ ቀለም
ar: لون الأيقونة
es: Color del icono

source: Legend Icons
am: የአፈ ታሪክ አዶዎች
ar: أيقونات الأسطورة
es: Iconos de leyenda

source: circle radius
am: የክበብ ራዲየስ
ar: نصف قطر الدائرة
es: radio del círculo

source: Line Chart
am: የመስመር ገበታ
ar: خط الرسم البياني
es: Gráfico de linea

source: Bar Chart
am: የአሞሌ ገበታ
ar: شريط الرسم البياني
es: Gráfico de barras

source: Show data for point
am: ለነጥብ ውሂብ አሳይ
ar: عرض البيانات للنقطة
es: Mostrar datos para el punto

source: Show timeseries data for point
am: የጊዜ ተከታታይ ውሂብ ለነጥብ አሳይ
ar: عرض بيانات السلاسل الزمنية للنقطة
es: Mostrar datos de series temporales para el punto

source: Data unit
am: የውሂብ ክፍል
ar: وحدة البيانات
es: unidad de datos

source: Chart Type
am: የገበታ አይነት
ar: نوع التخطيط
es: Tipo de gráfico

source: Chart Line/Bar Color
am: የገበታ መስመር/ባር ቀለም
ar: لون خط/شريط الرسم البياني
es: Color de línea/barra del gráfico

source: Mean of pixel values
am: የፒክሰል እሴቶች አማካኝ
ar: متوسط ​​قيم البكسل
es: Media de los valores de píxeles

source: Sum of pixel values
am: የፒክሰል እሴቶች ድምር
ar: مجموع قيم البكسل
es: Suma de valores de píxeles

source: Minimum, Maximum pixel values
am: ዝቅተኛ፣ ከፍተኛው የፒክሰል እሴቶች
ar: الحد الأدنى والحد الأقصى لقيم البكسل
es: Valores de píxeles mínimos y máximos

source: Minimum, Mean, Maximum pixel values
am: ዝቅተኛ፣ አማካኝ፣ ከፍተኛው የፒክሰል እሴቶች
ar: الحد الأدنى والمتوسط ​​والحد الأقصى لقيم البكسل
es: Valores de píxeles mínimos, medios y máximos

source: By Mean
am: በአማካይ
ar: بالطريقة
es: Por el medio

source: By Sum
am: በሱም
ar: بواسطة المبلغ
es: Por suma

source: Show data for area
am: ለአካባቢ ውሂብ አሳይ
ar: عرض بيانات المنطقة
es: Mostrar datos por área

source: Area value type
am: የአካባቢ እሴት ዓይነት
ar: نوع قيمة المنطقة
es: Tipo de valor de área

source: The value type that should be displayed
am: መታየት ያለበት የእሴት አይነት
ar: نوع القيمة التي يجب عرضها
es: El tipo de valor que debe mostrarse

source: Show timeseries data for area
am: የጊዜ ተከታታይ ውሂብ ለአካባቢ አሳይ
ar: عرض بيانات السلاسل الزمنية للمنطقة
es: Mostrar datos de series temporales para el área

source: Area timeseries data aggregation Method
am: የአካባቢ የጊዜ ተከታታይ ውሂብ ማጠቃለያ ዘዴ
ar: طريقة تجميع بيانات السلاسل الزمنية للمنطقة
es: Método de agregación de datos de series temporales de área

source: How should the region data be aggregated ?
am: የክልል መረጃ እንዴት ማጠቃለል አለበት?
ar: كيف ينبغي تجميع بيانات المنطقة؟
es: ¿Cómo se deben agregar los datos de la región?

source: circle stroke color
am: የክበብ ምት ቀለም
ar: لون السكتة الدماغية الدائرة
es: color del trazo del círculo

source: Link text
am: የአገናኝ ጽሑፍ
ar: نص الارتباط
es: Texto del enlace

source: Link Url
am: አገናኝ ዩአርኤል
ar: URL رابط
es: URL del enlace

source: Short description text
am: አጭር መግለጫ ጽሑፍ
ar: نص وصف قصير
es: Texto de descripción breve

source: Format link as action button
am: ማገናኛን እንደ የተግባር ቁልፍ ይቅረጹ
ar: تنسيق الرابط كزر إجراء
es: Dar formato al enlace como botón de acción

source: Show arrow in button
am: ቀስት በአዝራር አሳይ
ar: إظهار السهم في الزر
es: Mostrar flecha en el botón

source: layer
am: ንብርብር
ar: طبقة
es: capa

source: time
am: ጊዜ
ar: وقت
es: tiempo

source: Time for the raster file. This can be the time the data was acquired, or the date and time for which the data applies
am: የራስተር ፋይል ጊዜ። ይህ መረጃው የተገኘበት ጊዜ ወይም ውሂቡ የሚተገበርበት ቀን እና ሰዓት ሊሆን ይችላል።
ar: حان الوقت للملف النقطي. يمكن أن يكون هذا هو الوقت الذي تم فيه الحصول على البيانات، أو التاريخ والوقت الذي تنطبق عليه البيانات
es: Es hora del archivo ráster. Esta puede ser la hora en que se adquirieron los datos o la fecha y hora a la que se aplican los datos.

source: NetCDF Dates
am: NetCDF ቀኖች
ar: مواعيد NetCDF
es: Fechas NetCDF

source: Timestamps in the dataset
am: የጊዜ ማህተሞች በውሂብ ስብስብ ውስጥ
ar: الطوابع الزمنية في مجموعة البيانات
es: Marcas de tiempo en el conjunto de datos

source: Time is required for every uploaded vector file. This can be the time the dataset was collected, or applies to.
am: ለእያንዳንዱ ለተሰቀለው የቬክተር ፋይል ጊዜ ያስፈልጋል። ይህ የውሂብ ስብስብ የተሰበሰበበት ወይም የሚተገበርበት ጊዜ ሊሆን ይችላል።
ar: الوقت مطلوب لكل ملف متجه تم تحميله. يمكن أن يكون هذا هو الوقت الذي تم فيه جمع مجموعة البيانات أو تطبيقها عليه.
es: Se requiere tiempo para cada archivo vectorial cargado. Este puede ser el momento en que se recopiló el conjunto de datos o el momento al que corresponde.

source: database table name
am: የውሂብ ጎታ ሰንጠረዥ ስም
ar: اسم جدول قاعدة البيانات
es: nombre de la tabla de base de datos

source: dataset description
am: የውሂብ ስብስብ መግለጫ
ar: وصف مجموعة البيانات
es: descripción del conjunto de datos

source: optional dataset description
am: አማራጭ የውሂብ ስብስብ መግለጫ
ar: وصف مجموعة البيانات الاختيارية
es: descripción del conjunto de datos opcional

source: GADM Country Geopackage
am: GADM አገር ጂኦፓኬጅ
ar: الحزمة الجغرافية لدول GADM
es: Paquete geográfico de país GADM

source: The uploaded file should be a geopackage, downloaded from https://gadm.org/download_country.html
am: የተሰቀለው ፋይል ከhttps://gadm.org/download_country.html የወረደ ጂኦፓኬጅ መሆን አለበት።
ar: يجب أن يكون الملف الذي تم تحميله عبارة عن حزمة جغرافية، تم تنزيلها من https://gadm.org/download_country.html
es: El archivo cargado debe ser un paquete geográfico, descargado de https://gadm.org/download_country.html

source: Maximum value should be greater than minimum value
am: ከፍተኛው እሴት ከዝቅተኛው እሴት በላይ መሆን አለበት።
ar: يجب أن تكون القيمة القصوى أكبر من القيمة الدنيا
es: El valor máximo debe ser mayor que el valor mínimo.

source: Minimum value should be less than maximum value
am: ዝቅተኛው እሴት ከከፍተኛው እሴት ያነሰ መሆን አለበት
ar: يجب أن تكون القيمة الدنيا أقل من القيمة القصوى
es: El valor mínimo debe ser menor que el valor máximo.

source: Steps required when not using custom colors
am: ብጁ ቀለሞችን በማይጠቀሙበት ጊዜ ደረጃዎች ያስፈልጋሉ።
ar: الخطوات المطلوبة عند عدم استخدام الألوان المخصصة
es: Pasos necesarios cuando no se utilizan colores personalizados

source: Color for the rest of values must be specified
am: ለቀሪዎቹ እሴቶች ቀለም መገለጽ አለበት።
ar: يجب تحديد اللون لبقية القيم
es: Se debe especificar color para el resto de valores.

source: You selected to use custom colors but did not add any. Please add color values and save.
am: ብጁ ቀለሞችን ለመጠቀም መርጠዋል ነገር ግን ምንም አልጨመሩም። እባክዎ የቀለም ዋጋዎችን ያክሉ እና ያስቀምጡ።
ar: لقد حددت استخدام ألوان مخصصة ولكنك لم تقم بإضافة أي منها. الرجاء إضافة قيم الألوان وحفظها.
es: Seleccionó usar colores personalizados pero no agregó ninguno. Agregue valores de color y guárdelo.

source: Value must be greater than minimum defined value
am: እሴቱ ከተወሰነው ዝቅተኛ እሴት የበለጠ መሆን አለበት።
ar: يجب أن تكون القيمة أكبر من الحد الأدنى للقيمة المحددة
es: El valor debe ser mayor que el valor mínimo definido.

source: Value must be less than or equal to the maximum defined value
am: እሴቱ ከከፍተኛው ከተገለጸው እሴት ያነሰ ወይም እኩል መሆን አለበት።
ar: يجب أن تكون القيمة أقل من أو تساوي الحد الأقصى للقيمة المحددة
es: El valor debe ser menor o igual al valor máximo definido

source: Stations Shapefile ZIP
am: ጣቢያዎች ቅርጽ ዚፕ
ar: محطات Shapefile ZIP
es: Estaciones Shapefile ZIP

source: Station name field
am: የጣቢያ ስም መስክ
ar: حقل اسم المحطة
es: Campo de nombre de estación

source: Create Dataset
am: የውሂብ ስብስብ ይፍጠሩ
ar: إنشاء مجموعة البيانات
es: Crear conjunto de datos

source: Add Layer
am: ንብርብር አክል
ar: أضف طبقة
es: Agregar capa

source: Add %(object)s Layer
ar: أضف %(object)s طبقة
es: Agregar %(object)s capa

source: User
am: ተጠቃሚ
ar: مستخدم
es: Usuario

source: Name
am: ስም
ar: اسم
es: Nombre

source: Geostore Id
am: የጂኦስቶር መታወቂያ
ar: معرف المتجر الجغرافي
es: ID de almacén geográfico

source: Adm 0
am: አድም 0
ar: ادميرال 0
es: administrador 0

source: Adm 1
am: አድም 1
ar: ادميرال 1
es: administrador 1

source: Adm 2
am: አድም 2
ar: ادميرال 2
es: administrador 2

source: Adm 3
am: አድም 3
ar: ادميرال 3
es: administrador 3

source: Public
am: የህዝብ
ar: عام
es: Público

source: Type
am: ዓይነት
ar: يكتب
es: Tipo

source: Products
am: ምርቶች
ar: منتجات
es: Productos

source: Tags
am: መለያዎች
ar: العلامات
es: Etiquetas

source: Webhook Url
am: Webhook ዩአርኤል
ar: عنوان URL للويب هوك
es: URL del webhook

source: Area of Interest
am: የፍላጎት አካባቢ
ar: مجال الاهتمام
es: Area de interes

source: Areas of Interest
am: የፍላጎት ቦታዎች
ar: مجالات الاهتمام
es: Áreas de interés

source: title
am: ርዕስ
ar: عنوان
es: título

source: Title of the category
am: የምድቡ ርዕስ
ar: عنوان الفئة
es: Título de la categoría

source: icon
am: አዶ
ar: أيقونة
es: icono

source: active
am: ንቁ
ar: نشيط
es: activo

source: Is the category active ?
am: ምድቡ ንቁ ነው?
ar: هل الفئة نشطة؟
es: ¿Está activa la categoría?

source: public
am: የህዝብ
ar: عام
es: público

source: Is the category public ?
am: ምድቡ ይፋዊ ነው?
ar: هل الفئة عامة؟
es: ¿La categoría es pública?

source: Category
am: ምድብ
ar: فئة
es: Categoría

source: Categories
am: ምድቦች
ar: فئات
es: Categorías

source: Sub Categories
am: ንዑስ ምድቦች
ar: الفئات الفرعية
es: Subcategorías

source: Sub Category
am: ንዑስ ምድብ
ar: تصنيف فرعي
es: Subcategoría

source: Subcategory
am: ንዑስ ምድብ
ar: تصنيف فرعي
es: Subcategoría

source: Subcategories
am: ንዑስ ምድቦች
ar: الفئات الفرعية
es: Subcategorías

source: Raster File - NetCDF/GeoTiff
am: ራስተር ፋይል - NetCDF/GeoTiff
ar: الملف النقطي - NetCDF/GeoTiff
es: Archivo ráster: NetCDF/GeoTiff

source: Vector File - Shapefile, Geojson
am: የቬክተር ፋይል - Shapefile, Geojson
ar: ملف المتجهات - Shapefile، Geojson
es: Archivo vectorial: Shapefile, Geojson

source: Web Map Service - WMS Layer
am: የድር ካርታ አገልግሎት - WMS ንብርብር
ar: خدمة خرائط الويب - طبقة WMS
es: Servicio de mapas web: capa WMS

source: XYZ Raster Tile Layer
am: XYZ ራስተር ንጣፍ ንብርብር
ar: طبقة البلاط النقطية XYZ
es: Capa de mosaico ráster XYZ

source: XYZ Vector Tile Layer
am: XYZ የቬክተር ንጣፍ ንብርብር
ar: XYZ طبقة البلاط المتجه
es: Capa de mosaico vectorial XYZ

source: Latest From Source
am: ከምንጩ terbaru
ar: الأحدث من المصدر
es: Lo último de la fuente

source: Previous to now
am: ከአሁን በፊት
ar: السابق إلى الآن
es: Antes de ahora

source: Next to Now
am: ከአሁን ቀጥሎ
ar: بجانب الآن
es: Al lado de ahora

source: The Dataset title as will appear to the public
am: ለሕዝብ እንደሚታይ የውሂብ ስብስብ ርዕስ
ar: عنوان مجموعة البيانات كما سيظهر للعامة
es: El título del conjunto de datos tal como aparecerá al público.

source: category
am: ምድብ
ar: فئة
es: categoría

source: summary
am: ማጠቃለያ
ar: ملخص
es: resumen

source: Short summary of less than 100 characters
am: ከ100 በታች ቁምፊዎች አጭር ማጠቃለያ
ar: ملخص قصير لا يزيد عن 100 حرف
es: Breve resumen de menos de 100 caracteres.

source: Layer type
am: የንብርብር ዓይነት
ar: نوع الطبقة
es: Tipo de capa

source: published
am: የታተመ
ar: نشرت
es: publicado

source: Should the dataset be available for visualization ? If unchecked, the dataset is assumed to be in draft mode and thus not ready
am: የውሂብ ስብስብ ለዕይታ መገኘት አለበት? ምልክት ካልተደረገበት የመረጃ ቋቱ በረቂቅ ሁነታ ላይ ነው ተብሎ ስለሚታሰብ ዝግጁ አይደለም።
ar: هل يجب أن تكون مجموعة البيانات متاحة للتصور؟ إذا لم يتم تحديدها، فمن المفترض أن تكون مجموعة البيانات في وضع المسودة وبالتالي ليست جاهزة
es: ¿El conjunto de datos debería estar disponible para su visualización? Si no está marcado, se supone que el conjunto de datos está en modo borrador y, por lo tanto, no está listo.

source: Should the dataset be visible to everyone ? If unchecked, only authorized users can view
am: የውሂብ ስብስብ ለሁሉም ሰው መታየት አለበት? ካልተመረጠ፣ የተፈቀደላቸው ተጠቃሚዎች ብቻ ማየት ይችላሉ።
ar: هل يجب أن تكون مجموعة البيانات مرئية للجميع؟ إذا لم يتم تحديده، فيمكن للمستخدمين المصرح لهم فقط المشاهدة
es: ¿El conjunto de datos debería ser visible para todos? Si no está marcado, solo los usuarios autorizados pueden ver

source: Initially visible on Map by default
am: በነባሪነት መጀመሪያ ላይ በካርታው ላይ ይታያል
ar: تكون مرئية في البداية على الخريطة بشكل افتراضي
es: Inicialmente visible en el mapa de forma predeterminada

source: Make the dataset visible on the map by default
am: የውሂብ ስብስብ በነባሪ በካርታው ላይ እንዲታይ ያድርጉ
ar: اجعل مجموعة البيانات مرئية على الخريطة افتراضيًا
es: Hacer que el conjunto de datos sea visible en el mapa de forma predeterminada

source: Multi-temporal
am: ባለብዙ-ጊዜያዊ
ar: متعدد الزمانية

source: The dataset is multi-temporal
am: የመረጃ ቋቱ ብዙ ጊዜያዊ ነው።
ar: مجموعة البيانات متعددة الزمان
es: El conjunto de datos es multitemporal.

source: Multi-layer
am: ባለብዙ-ንብርብር
ar: متعدد الطبقات
es: multicapa

source: The dataset has more than one layer, to be displayed together
am: የመረጃ ቋቱ አንድ ላይ ለመታየት ከአንድ በላይ ንብርብር አለው።
ar: تحتوي مجموعة البيانات على أكثر من طبقة ليتم عرضها معًا
es: El conjunto de datos tiene más de una capa, que se mostrarán juntas

source: Near realtime
am: በእውነተኛ ሰዓት አቅራቢያ
ar: بالقرب من الوقت الحقيقي
es: Casi en tiempo real

source: Is the layer near realtime?, for example updates every 10 minutes
am: ንብርብሩ በእውነተኛ ሰዓት አቅራቢያ ነው?፣ ለምሳሌ በየ10 ደቂቃው ይሻሻላል
ar: هل الطبقة قريبة من الوقت الفعلي؟، على سبيل المثال يتم تحديثها كل 10 دقائق
es: ¿La capa está casi en tiempo real? Por ejemplo, se actualiza cada 10 minutos.

source: current time method
am: የአሁኑ ጊዜ ዘዴ
ar: طريقة الوقت الحالي
es: método de tiempo actual

source: How to pick default time and for updates, for Multi-Temporal data
am: ነባሪ ጊዜን እንዴት እንደሚመርጡ እና ለዝማኔዎች ፣ ለብዙ ጊዜያዊ ውሂብ
ar: كيفية اختيار الوقت الافتراضي وللتحديثات، للبيانات المؤقتة المتعددة
es: Cómo elegir la hora predeterminada y las actualizaciones para datos multitemporales

source: Auto Update interval in minutes
am: በደቂቃዎች ውስጥ በራስ-ያዘምኑ
ar: الفاصل الزمني للتحديث التلقائي في دقائق
es: Intervalo de actualización automática en minutos

source: After how many minutes should the layer auto update on the map to show current data, if multi-temporal. Leave empty to disable auto updating
am: ብዙ ጊዜያዊ ከሆነ የአሁኑን ውሂብ ለማሳየት ንብርብሩ ከስንት ደቂቃዎች በኋላ በካርታው ላይ በራስ-ሰር ማዘመን አለበት። ራስ-ማዘመንን ለማሰናከል ባዶ ይተውት።
ar: بعد كم دقيقة يجب تحديث الطبقة تلقائيًا على الخريطة لإظهار البيانات الحالية، إذا كانت متعددة الفترات. اتركه فارغًا لتعطيل التحديث التلقائي
es: Después de cuántos minutos debe actualizarse automáticamente la capa en el mapa para mostrar los datos actuales, si es multitemporal. Déjelo vacío para deshabilitar la actualización automática

source: Enable Clipping by shape
am: በቅርጽ መቁረጥን አንቃ
ar: تمكين القطع حسب الشكل
es: Habilitar recorte por forma

source: Check to enable clipping by boundary or drawn shapes, for raster and vector datasets. Not implemented for WMS types
am: ለራስተር እና ለቬክተር ዳታ ስብስቦች በወሰን ወይም በተሳሉ ቅርጾች መቁረጥን ማንቃትን ያረጋግጡ። ለ WMS አይነቶች አልተተገበረም።
ar: قم بالتحقق لتمكين القص حسب الحدود أو الأشكال المرسومة لمجموعات البيانات النقطية والمتجهة. لم يتم تنفيذه لأنواع WMS
es: Marque para habilitar el recorte por límites o formas dibujadas, para conjuntos de datos ráster y vectoriales. No implementado para tipos WMS

source: Dataset
am: የውሂብ ስብስብ
ar: مجموعة البيانات
es: Conjunto de datos

source: Datasets
am: የውሂብ ስብስቦች
ar: مجموعات البيانات
es: Conjuntos de datos

source: Title of the dataset
am: የውሂብ ስብስብ ርዕስ
ar: عنوان مجموعة البيانات
es: Título del conjunto de datos

source: subtitle
am: ንዑስ ርዕስ
ar: العنوان الفرعي
es: subtitular

source: Subtitle if any
am: ካለ የትርጉም ጽሑፍ
ar: الترجمة إن وجدت
es: Subtítulo si lo hubiera

source: Dataset summary
am: የውሂብ ስብስብ ማጠቃለያ
ar: ملخص مجموعة البيانات
es: Resumen del conjunto de datos

source: Short summary of what the dataset shows. Keep it short.
am: የመረጃ ቋቱ የሚያሳየው አጭር ማጠቃለያ። አጠር አድርጉት።
ar: ملخص قصير لما تظهره مجموعة البيانات. اختصر.
es: Breve resumen de lo que muestra el conjunto de datos. Que sea breve.

source: resolution
am: መፍትሄ
ar: دقة
es: resolución

source: The Spatial resolution of the dataset, for example 10km by 10 km
am: የውሂብ ስብስብ የቦታ ጥራት, ለምሳሌ 10 ኪሜ በ 10 ኪ.ሜ
ar: الدقة المكانية لمجموعة البيانات، على سبيل المثال 10 كم × 10 كم
es: La resolución espacial del conjunto de datos, por ejemplo 10 km por 10 km.

source: Geographic coverage
am: የጂኦግራፊያዊ ሽፋን
ar: التغطية الجغرافية
es: Cobertura geográfica

source: The geographic coverage of the dataset. For example East Africa or specific country name like Ethiopia, or Africa
am: የውሂብ ስብስብ ጂኦግራፊያዊ ሽፋን. ለምሳሌ የምስራቅ አፍሪካ ወይም የተለየ አገር ስም እንደ ኢትዮጵያ ወይም አፍሪካ
ar: التغطية الجغرافية لمجموعة البيانات. على سبيل المثال شرق أفريقيا أو اسم بلد محدد مثل إثيوبيا، أو أفريقيا
es: La cobertura geográfica del conjunto de datos. Por ejemplo, África Oriental o un nombre de país específico como Etiopía o África.

source: source
am: ምንጭ
ar: مصدر
es: fuente

source: The source of the data where was it generated or produced
am: የመረጃው ምንጭ የመነጨው ወይም የተመረተበት ቦታ ነው።
ar: مصدر البيانات وأين تم توليدها أو إنتاجها
es: La fuente de los datos donde se generaron o produjeron.

source: license
am: ፈቃድ
ar: رخصة
es: licencia

source: Any licensing information for the dataset
am: ለውሂብ ስብስብ ማንኛውም የፍቃድ መረጃ
ar: أي معلومات ترخيص لمجموعة البيانات
es: Cualquier información de licencia para el conjunto de datos.

source: Frequency of updates
am: የዝማኔዎች ድግግሞሽ
ar: تواتر التحديثات
es: Frecuencia de actualizaciones

source: How frequent is the dataset updated. For example daily, weekly, monthly etc
am: የመረጃ ቋቱ ምን ያህል ተደጋጋሚነት ተዘምኗል። ለምሳሌ በየቀኑ፣ በየሳምንቱ፣ በየወሩ ወዘተ
ar: ما مدى تكرار تحديث مجموعة البيانات. على سبيل المثال يوميا وأسبوعيا وشهريا وما إلى ذلك
es: ¿Con qué frecuencia se actualiza el conjunto de datos? Por ejemplo diario, semanal, mensual, etc.

source: detail
am: ዝርዝር
ar: التفاصيل
es: detalle

source: Detail description of the dataset, including the methodology, references or any other relevant information
am: ዘዴውን፣ ማጣቀሻዎችን ወይም ሌላ ማንኛውንም ተዛማጅ መረጃን ጨምሮ የውሂብ ስብስብ ዝርዝር መግለጫ
ar: وصف تفصيلي لمجموعة البيانات، بما في ذلك المنهجية والمراجع أو أي معلومات أخرى ذات صلة
es: Descripción detallada del conjunto de datos, incluida la metodología, referencias o cualquier otra información relevante.

source: cautions
am: ያስጠነቅቃል
ar: تحذيرات
es: precauciones

source: What things should users be aware as they use and interpret this dataset
am: ተጠቃሚዎች ይህንን የውሂብ ስብስብ ሲጠቀሙ እና ሲተረጉሙ ምን ማወቅ አለባቸው
ar: ما الأشياء التي يجب على المستخدمين معرفتها أثناء استخدامهم لمجموعة البيانات هذه وتفسيرها
es: ¿Qué cosas deben tener en cuenta los usuarios al utilizar e interpretar este conjunto de datos?

source: citation
am: ጥቅስ
ar: الاقتباس
es: citación

source: Scientific citation for this dataset if any. For example the citation for a scientific paper for the dataset
am: ለዚህ የውሂብ ስብስብ ሳይንሳዊ ጥቅስ ካለ። ለምሳሌ ለዳታ ስብስብ የሳይንሳዊ ወረቀት ጥቅስ
ar: الاقتباس العلمي لمجموعة البيانات هذه إن وجدت. على سبيل المثال، الاقتباس لورقة علمية لمجموعة البيانات
es: Cita científica para este conjunto de datos, si corresponde. Por ejemplo, la cita de un artículo científico para el conjunto de datos.

source: Data download link
am: የውሂብ ማውረድ አገናኝ
ar: رابط تحميل البيانات
es: enlace de descarga de datos

source: External link to where the source data can be found and downloaded
am: የምንጭ ውሂብ ወደሚገኝበት እና ወደሚወርድበት ውጫዊ አገናኝ
ar: رابط خارجي حيث يمكن العثور على البيانات المصدر وتنزيلها
es: Enlace externo donde se pueden encontrar y descargar los datos de origen

source: Learn more link
am: ተጨማሪ አገናኝ ይወቁ
ar: معرفة المزيد الرابط
es: Más información enlace

source: External link to where more detail about the dataset can be found
am: ስለ የውሂብ ስብስብ የበለጠ ዝርዝር ወደሚገኝበት ውጫዊ አገናኝ
ar: رابط خارجي حيث يمكن العثور على مزيد من التفاصيل حول مجموعة البيانات
es: Enlace externo donde se pueden encontrar más detalles sobre el conjunto de datos.

source: Layer title
am: የንብርብር ርዕስ
ar: عنوان الطبقة
es: Título de capa

source: Is Default Layer
am: ነባሪ ንብርብር ነው።
ar: هي الطبقة الافتراضية
es: Es la capa predeterminada

source: Maximum upload size in MegaBytes
am: ከፍተኛው የሰቀላ መጠን በ MegaBytes
ar: الحد الأقصى لحجم التحميل بالميجابايت
es: Tamaño máximo de carga en MegaBytes

source: Maximum raster file size that can be uploaded in MegaBytes. Default is 10Mbs.
am: በሜጋባይት ውስጥ ሊሰቀል የሚችል ከፍተኛው የራስተር ፋይል መጠን። ነባሪው 10 ሜባ ነው።
ar: الحد الأقصى لحجم الملف النقطي الذي يمكن تحميله بالميجابايت. الافتراضي هو 10 ميغا بايت.
es: Tamaño máximo de archivo ráster que se puede cargar en MegaBytes. El valor predeterminado es 10 MB.

source: Crop raster to country
am: ራስተርን ወደ ሀገር ይከርክሙ
ar: اقتصاص البيانات النقطية إلى البلد
es: Recortar ráster al país

source: Crop the uploaded raster file to the country boundaries
am: የተሰቀለውን ራስተር ፋይል ወደ ሀገር ድንበሮች ይከርክሙት
ar: قم بقص الملف النقطي الذي تم تحميله إلى حدود البلد
es: Recorte el archivo ráster cargado hasta los límites del país

source: cap base url
am: ካፕ ቤዝ url
ar: عنوان URL الأساسي للغطاء
es: URL base de la tapa

source: cap layer sub category
am: ካፕ ንብርብር ንዑስ ምድብ
ar: فئة فرعية من طبقة الغطاء
es: subcategoría de capa de tapa

source: Auto Refresh interval in minutes
am: በደቂቃዎች ውስጥ በራስ-አድስ
ar: الفاصل الزمني للتحديث التلقائي في دقائق
es: Intervalo de actualización automática en minutos

source: Refresh cap alerts on the map after this minutes. Leave blank to disable auto refreshing
am: ከዚህ ደቂቃዎች በኋላ በካርታው ላይ የካፕ ማንቂያዎችን ያድሱ። ራስ-አድስን ለማሰናከል ባዶ ይተውት።
ar: قم بتحديث تنبيهات الحد الأقصى على الخريطة بعد هذه الدقائق. اتركه فارغًا لتعطيل التحديث التلقائي
es: Actualizar las alertas de límite en el mapa después de estos minutos. Déjelo en blanco para desactivar la actualización automática.

source: CAP layer shown by default
am: የ CAP ንብርብር በነባሪነት ይታያል
ar: تظهر طبقة CAP بشكل افتراضي
es: Capa CAP mostrada por defecto

source: CAP Layer shown on map by default
am: CAP ንብርብር በነባሪ በካርታው ላይ ይታያል
ar: تظهر طبقة CAP على الخريطة بشكل افتراضي
es: Capa CAP mostrada en el mapa de forma predeterminada

source: GADM Boundary Data Version
am: GADM ድንበር ውሂብ ስሪት
ar: إصدار بيانات حدود GADM
es: Versión de datos de límites GADM

source: It is encouraged to use the latest version. See available versions here: https://gadm.org/old_versions.html
am: የቅርብ ጊዜውን ስሪት እንዲጠቀሙ ይበረታታሉ. ያሉትን ስሪቶች እዚህ ይመልከቱ፡ https://gadm.org/old_versions.html
ar: يُنصح باستخدام أحدث إصدار. راجع الإصدارات المتاحة هنا: https://gadm.org/old_versions.html
es: Se recomienda utilizar la última versión. Vea las versiones disponibles aquí: https://gadm.org/old_versions.html

source: GL Styles Font Url
am: GL ቅጦች ቅርጸ ቁምፊ ዩአርኤል
ar: عنوان URL لخط أنماط GL
es: URL de fuente de estilos GL
