Repository: pypi-data/pypi-mirror-381
Catalog: packages/geomanager/geomanager-0.5.8-py3-none-any.whl/geomanager/locale/*/LC_MESSAGES/django.po
Languages: am, ar, es

source: Open Map Tiles Source
am: የካርታ ሰቆች ምንጭ ክፈት
ar: افتح مصدر مربعات الخريطة
es: Abrir fuente de mosaicos de mapa

source: Logo
am: አርማ
ar: شعار

source: Logo page
am: የአርማ ገጽ
ar: صفحة الشعار
es: Página del logotipo

source: Internal page to navigate to on clicking the logo
am: አርማውን ጠቅ በማድረግ ወደ ውስጥ ለመግባት የውስጥ ገጽ
ar: الصفحة الداخلية للانتقال إليها عند النقر على الشعار
es: Página interna a la que navegar al hacer clic en el logo

source: Logo external link
am: ሎግ ውጫዊ አገናኝ
ar: رابط خارجي للشعار
es: Enlace externo del logotipo

source: Used if internal logo page not provided
am: የውስጥ አርማ ገጽ ካልተሰጠ ጥቅም ላይ ይውላል
ar: يُستخدم في حالة عدم توفير صفحة الشعار الداخلي
es: Se utiliza si no se proporciona la página del logotipo interno

source: Terms of Service Page
am: የአገልግሎት ውል ገጽ
ar: صفحة شروط الخدمة
es: Página de términos de servicio

source: MapViewer Terms of Service page
am: MapViewer የአገልግሎት ውል ገጽ
ar: صفحة شروط خدمة MapViewer
es: Página de Términos de servicio de MapViewer

source: Privacy Policy Page
am: የግላዊነት ፖሊሲ ገጽ
ar: صفحة سياسة الخصوصية
es: Página de política de privacidad

source: MapViewer Privacy Policy Page
am: MapViewer የግላዊነት መመሪያ ገጽ
ar: صفحة سياسة الخصوصية لبرنامج MapViewer
es: Página de política de privacidad de MapViewer

source: background color
am: የጀርባ ቀለም
ar: لون الخلفية
es: color de fondo

source: image
am: ምስል
ar: صورة
es: imagen

source: basemap group
am: የመሠረት ካርታ ቡድን
ar: مجموعة خريطة الأساس
es: grupo de mapas base

source: labels group
am: መለያዎች ቡድን
ar: مجموعة التسميات
es: grupo de etiquetas

source: url
am: ዩአርኤል
ar: عنوان URL

source: Is default style ?
am: ነባሪ ቅጥ ነው?
ar: هل هو النمط الافتراضي؟
es: ¿Es el estilo predeterminado?

source: Geomanager Settings
am: የጂኦማናጀር ቅንብሮች
ar: إعدادات المدير الجغرافي
es: Configuración del Geoadministrador

source: Upload Settings
am: ቅንብሮችን ይጫኑ
ar: إعدادات التحميل
es: Cargar configuración

source: Basemap TileServer Settings
am: Bamap TileServer ቅንብሮች
ar: إعدادات خادم بلاط خريطة الأساس
es: Configuración del servidor TileServer del mapa base

source: CAP Layer Settings
am: CAP ንብርብር ቅንብሮች
ar: إعدادات طبقة CAP
es: Configuración de capa CAP

source: Navigation Settings
am: የአሰሳ ቅንብሮች
ar: إعدادات التنقل
es: Configuración de navegación

source: Gender
am: ጾታ
ar: جنس
es: Género

source: Country
am: ሀገር
ar: دولة
es: País

source: City
am: ከተማ
ar: مدينة
es: Ciudad

source: Sector
am: ዘርፍ
ar: قطاع

source: Organization
am: ድርጅት
ar: منظمة
es: Organización

source: Organization Type
am: የድርጅት አይነት
ar: نوع المنظمة
es: Tipo de organización

source: Scale of Operations
am: የክዋኔዎች ልኬት
ar: نطاق العمليات
es: Escala de operaciones

source: Position
am: አቀማመጥ
ar: موضع
es: Posición

source: How do you Use
am: እንዴት ነው የምትጠቀመው
ar: كيف تستخدم
es: Cómo usas

source: Interests
am: ፍላጎቶች
ar: الإهتمامات
es: Intereses

source: GeoManager User Profile
am: GeoManager የተጠቃሚ መገለጫ
ar: ملف تعريف مستخدم GeoManager
es: Perfil de usuario de GeoManager

source: GeoManager User Profiles
am: GeoManager የተጠቃሚ መገለጫዎች
ar: ملفات تعريف مستخدم GeoManager
es: Perfiles de usuario de GeoManager

source: style
am: ዘይቤ
ar: أسلوب
es: estilo

source: Point Analysis
am: የነጥብ ትንተና
ar: تحليل النقطة
es: Análisis de puntos

source: Area Analysis
am: የአካባቢ ትንተና
ar: تحليل المنطقة
es: Análisis de área

source: Analysis
am: ትንተና
ar: تحليل
es: Análisis

source: Raster File Layer
am: ራስተር ፋይል ንብርብር
ar: طبقة الملف النقطية
es: Capa de archivo ráster

source: Raster File Layers
am: ራስተር ፋይል ንብርብሮች
ar: طبقات الملفات النقطية
es: Capas de archivos ráster

source: Create Style
am: ዘይቤ ይፍጠሩ
ar: إنشاء نمط
es: Crear estilo

source: Edit Style
am: ቅጥን ያርትዑ
ar: تحرير النمط
es: Editar estilo

source: Can not add layer because the dataset is not marked as Multi Layer. To add multiple layers to a dataset, please mark the dataset as Multi Layer and try again
am: ንብርብር ማከል አይቻልም ምክንያቱም የውሂብ ስብስብ እንደ መልቲ ንብርብር ምልክት ስላልተደረገበት። ብዙ ንብርብሮችን ወደ የውሂብ ስብስብ ለማከል፣ እባክዎ የውሂብ ስብስቡን እንደ መልቲ ንብርብር ምልክት ያድርጉ እና እንደገና ይሞክሩ
ar: لا يمكن إضافة طبقة لأنه لم يتم وضع علامة على مجموعة البيانات على أنها متعددة الطبقات. لإضافة طبقات متعددة إلى مجموعة بيانات، يرجى وضع علامة على مجموعة البيانات على أنها متعددة الطبقات والمحاولة مرة أخرى
es: No se puede agregar una capa porque el conjunto de datos no está marcado como multicapa. Para agregar varias capas a un conjunto de datos, marque el conjunto de datos como Multicapa e inténtelo nuevamente

source: file
am: ፋይል
ar: ملف
es: archivo

source: Layer Raster File
am: የንብርብር ራስተር ፋይል
ar: ملف طبقة النقطية
es: Archivo ráster de capa

source: Layer Raster Files
am: የንብርብር ራስተር ፋይሎች
ar: ملفات طبقة النقطية
es: Archivos ráster de capa

source: Raster Upload
am: ራስተር ሰቀላ
ar: تحميل النقطية
es: Carga de ráster

source: Raster Uploads
am: ራስተር ሰቀላዎች
ar: التحميلات النقطية
es: Cargas de ráster

source: Style name for identification
am: ለመለየት የቅጥ ስም
ar: اسم النمط لتحديد الهوية
es: Nombre de estilo para identificación

source: data unit
am: የውሂብ ክፍል
ar: وحدة البيانات
es: unidad de datos

source: minimum value
am: ዝቅተኛ ዋጋ
ar: الحد الأدنى للقيمة
es: valor mínimo

source: maximum value
am: ከፍተኛ ዋጋ
ar: القيمة القصوى
es: valor máximo

source: steps
am: ደረጃዎች
ar: خطوات
es: pasos

source: Number of steps
am: የእርምጃዎች ብዛት
ar: عدد من الخطوات
es: Numero de pasos

source: Use Custom Colors
am: ብጁ ቀለሞችን ተጠቀም
ar: استخدم الألوان المخصصة
es: Usar colores personalizados

source: Color Palette
am: የቀለም ቤተ-ስዕል
ar: لوحة الألوان
es: Paleta de color

source: interpolate
am: ጣልቃ መግባት
ar: تحقق
es: interpolar

source: Color for the rest of values
am: ለተቀሩት እሴቶች ቀለም
ar: اللون لبقية القيم
es: Color para el resto de valores.

source: Color for values greater than the values defined above, as well as values greater than the maximum defined value
am: ከላይ ከተገለጹት እሴቶች ለሚበልጡ እሴቶች ቀለም እና ከከፍተኛው ከተገለፀው እሴት በላይ የሆኑ እሴቶች
ar: لون للقيم الأكبر من القيم المحددة أعلاه، وكذلك القيم الأكبر من الحد الأقصى للقيمة المحددة
es: Color para valores mayores que los valores definidos anteriormente, así como valores mayores que el valor máximo definido

source: Raster Style
am: ራስተር ዘይቤ
ar: النمط النقطي
es: Estilo ráster

source: Raster Styles
am: ራስተር ቅጦች
ar: الأنماط النقطية
es: Estilos ráster

source: Data values
am: የውሂብ ዋጋዎች
ar: قيم البيانات
es: Valores de datos

source: Color Values
am: የቀለም እሴቶች
ar: قيم اللون
es: Valores de color

source: Color Value
am: የቀለም እሴት
ar: قيمة اللون
es: Valor de color

source: Custom Color Values
am: ብጁ የቀለም እሴቶች
ar: قيم الألوان المخصصة
es: Valores de color personalizados

source: Threshold value
am: የመነሻ ዋጋ
ar: قيمة العتبة
es: Valor umbral

source: Values less than or equal to the input value, will be assigned the chosen color
am: ከግቤት እሴቱ ያነሱ ወይም እኩል የሆኑ እሴቶች የተመረጠው ቀለም ይመደባሉ
ar: سيتم تعيين اللون المختار للقيم الأقل من أو المساوية لقيمة الإدخال
es: A los valores menores o iguales al valor ingresado, se les asignará el color elegido

source: Label for Legend
am: ለአፈ ታሪክ መለያ
ar: تسمية للأسطورة
es: Etiqueta para leyenda

source: Raster Tile Layer
am: ራስተር ንጣፍ ንብርብር
ar: طبقة البلاط النقطية
es: Capa de mosaico ráster

source: Raster Tile Layers
am: ራስተር ንጣፍ ንብርብሮች
ar: طبقات البلاط النقطية
es: Capas de mosaicos rasterizados

source: Base Tile url
ar: عنوان URL للبلاط الأساسي
es: URL del mosaico base

source: Query Parameter
am: የጥያቄ መለኪያ
ar: معلمة الاستعلام
es: Parámetro de consulta

source: Static Query Params
am: የማይንቀሳቀስ መጠይቅ Params
ar: معلمات الاستعلام الثابتة
es: Parámetros de consulta estática

source: Static query params to be added to the url
am: ወደ ዩአርኤል የሚታከሉ የማይለዋወጡ መጠይቅ ፓራሞች
ar: معلمات الاستعلام الثابتة المراد إضافتها إلى عنوان url
es: Parámetros de consulta estática que se agregarán a la URL

source: Selectable Query Parameter
am: ሊመረጥ የሚችል የጥያቄ መለኪያ
ar: معلمة الاستعلام القابلة للتحديد
es: Parámetro de consulta seleccionable

source: Query Params With selectable Options
am: መጠይቅ ፓራሞች ከሚመረጡ አማራጮች ጋር
ar: معلمات الاستعلام مع خيارات قابلة للتحديد
es: Parámetros de consulta con opciones seleccionables

source: This should provide a list of options that users can choose to change the query parameter of the url
am: ይህ ተጠቃሚዎች የዩ አር ኤልን መጠይቅ ልኬት ለመለወጥ የሚመርጧቸውን የአማራጮች ዝርዝር ማቅረብ አለበት።
ar: يجب أن يوفر هذا قائمة بالخيارات التي يمكن للمستخدمين اختيارها لتغيير معلمة الاستعلام لعنوان url
es: Esto debería proporcionar una lista de opciones que los usuarios pueden elegir para cambiar el parámetro de consulta de la URL.

source: Arrange Param Selectors side by side
am: የፓራም መምረጫዎችን ጎን ለጎን ያዘጋጁ
ar: ترتيب محددات Param جنبًا إلى جنب
es: Organizar los selectores de parámetros uno al lado del otro

source: Custom Legend
am: ብጁ አፈ ታሪክ
ar: أسطورة مخصصة
es: Leyenda personalizada

source: Custom Image
am: ብጁ ምስል
ar: صورة مخصصة
es: Imagen personalizada

source: Legend Icon
am: የአፈ ታሪክ አዶ
ar: أيقونة الأسطورة
es: Icono de leyenda

source: Legend
am: አፈ ታሪክ
ar: أسطورة
es: Leyenda

source: Info link
am: የመረጃ አገናኝ
ar: رابط المعلومات
es: Enlace de información

source: More Info
am: ተጨማሪ መረጃ
ar: مزيد من المعلومات
es: Más información

source: Get time from tile json url
am: ከ tile json url ጊዜ ያግኙ
ar: احصل على الوقت من عنوان URL للبلاط json
es: Obtener tiempo desde la URL json del mosaico

source: Tile JSON url
am: የሰድር JSON url
ar: عنوان URL للبلاط JSON
es: URL JSON de mosaico

source: Timestamps response object key
am: የጊዜ ማህተሞች ምላሽ የነገር ቁልፍ
ar: مفتاح كائن استجابة الطوابع الزمنية
es: Clave de objeto de respuesta de marcas de tiempo

source: Key for timestamps values in response object
am: በምላሽ ነገር ውስጥ የጊዜ ማህተም እሴቶች ቁልፍ
ar: مفتاح لقيم الطوابع الزمنية في كائن الاستجابة
es: Clave para valores de marcas de tiempo en el objeto de respuesta

source: TileJson Settings
am: TileJson ቅንብሮች
ar: إعدادات TileJson
es: Configuración de TileJson

source: Style Name
am: የቅጥ ስም
ar: اسم النمط
es: Nombre de estilo

source: Use default style
am: ነባሪ ዘይቤን ተጠቀም
ar: استخدم النمط الافتراضي
es: Usar estilo predeterminado

source: OpenMapTiles style
am: ክፍትMapTiles ዘይቤ
ar: نمط OpenMapTiles
es: Estilo OpenMapTiles

source: Basemap Source
am: ቤዝማፕ ምንጭ
ar: مصدر خريطة الأساس
es: Fuente del mapa base

source: Basemap Sources
am: ቤዝማፕ ምንጮች
ar: مصادر خريطة الأساس
es: Fuentes de mapas base

source: Polygon Layer
am: ባለብዙ ጎን ንብርብር
ar: طبقة المضلع
es: Capa de polígono

source: Line Layer
am: የመስመር ንብርብር
ar: طبقة الخط
es: Capa de línea

source: Point Layer
am: ነጥብ ንብርብር
ar: طبقة النقطة
es: Capa de puntos

source: Icon Layer
am: አዶ ንብርብር
ar: طبقة الأيقونة
es: Capa de icono

source: Text Label Layer
am: የጽሑፍ መለያ ንብርብር
ar: طبقة تسمية النص
es: Capa de etiqueta de texto

source: Render Layers
am: የማሳያ ንብርብሮች
ar: تقديم الطبقات
es: Renderizar capas

source: Legend Image
am: አፈ ታሪክ ምስል
ar: صورة الأسطورة
es: Imagen de leyenda

source: Vector File Layer
am: የቬክተር ፋይል ንብርብር
ar: طبقة ملف المتجهات
es: Capa de archivo vectorial

source: Vector File Layers
am: የቬክተር ፋይል ንብርብሮች
ar: طبقات ملف المتجهات
es: Capas de archivos vectoriales

source: Vector Layer Icon
am: የቬክተር ንብርብር አዶ
ar: أيقونة طبقة المتجهات
es: Icono de capa vectorial

source: Vector Layer Icons
am: የቬክተር ንብርብር አዶዎች
ar: أيقونات طبقة المتجهات
es: Iconos de capa vectorial

source: Vector Upload
am: የቬክተር ጭነት
ar: تحميل المتجهات
es: Subir vectores

source: Vector Uploads
am: የቬክተር ሰቀላዎች
ar: تحميلات المتجهات
es: Cargas de vectores

source: time for the dataset
am: የውሂብ ስብስብ የሚሆን ጊዜ
ar: الوقت لمجموعة البيانات
es: tiempo para el conjunto de datos

source: source layer
am: የምንጭ ንብርብር
ar: طبقة المصدر
es: capa fuente

source: Vector Tile Layer
am: የቬክተር ንጣፍ ንብርብር
ar: طبقة البلاط المتجه
es: Capa de mosaico vectorial

source: Vector Tile Layers
am: የቬክተር ንጣፍ ንብርብሮች
ar: طبقات البلاط المتجه
es: Capas de mosaicos vectoriales

source: Hourly - (E.g 2023-01-01 00:00)
am: በየሰዓቱ - (ለምሳሌ 2023-01-01 00:00)
ar: كل ساعة - (على سبيل المثال 2023-01-01 00:00)
es: Cada hora - (por ejemplo, 2023-01-01 00:00)

source: Daily - (E.g 2023-01-01)
am: በየቀኑ - (ለምሳሌ 2023-01-01)
ar: يوميًا - (على سبيل المثال 2023-01-01)
es: Diario - (por ejemplo, 2023-01-01)

source: Monthly - (E.g 2023-01)
am: ወርሃዊ - (ለምሳሌ 2023-01)
ar: شهريًا - (على سبيل المثال 2023-01)
es: Mensual - (por ejemplo, 2023-01)

source: Monthly - (E.g January 2023)
am: ወርሃዊ - (ለምሳሌ ጃንዋሪ 2023)
ar: شهريًا - (على سبيل المثال، يناير 2023)
es: Mensual - (por ejemplo, enero de 2023)

source: Pentadal - (E.g Jan 2023 - P1 1-5th)
am: ፔንታዳል - (ለምሳሌ ጃንዋሪ 2023 - ፒ1 1-5ኛ)
ar: Pentadal - (على سبيل المثال، يناير 2023 - P1 1-5)
es: Pentadal - (por ejemplo, enero de 2023 - P1 1-5)

source: Request time from capabilities
am: ከችሎታዎች ጊዜ ይጠይቁ
ar: طلب الوقت من القدرات
es: Solicitar tiempo de capacidades

source: Get list of available times for this layer from getCapabilities
am: ለዚህ ንብርብር የሚገኙትን ጊዜዎች ዝርዝር ከgetCapabilities ያግኙ
ar: احصل على قائمة بالأوقات المتاحة لهذه الطبقة من getCapabilities
es: Obtenga una lista de tiempos disponibles para esta capa desde getCapabilities

source: base url for WMS
am: ቤዝ ዩአርኤል ለ WMS
ar: عنوان URL الأساسي لـ WMS
es: URL base para WMS

source: WMS Version
am: የ WMS ስሪት
ar: نسخة دبليو إم إس
es: Versión WMS

source: Pixel Width
am: የፒክሰል ስፋት
ar: عرض البكسل
es: Ancho de píxel

source: The size of the map image in pixels along the i axis
am: በ i ዘንግ ላይ ያለው የካርታ ምስል መጠን በፒክሰሎች ውስጥ
ar: حجم صورة الخريطة بالبكسل على طول المحور i
es: El tamaño de la imagen del mapa en píxeles a lo largo del eje i.

source: Pixel Height
am: የፒክሰል ቁመት
ar: ارتفاع البكسل
es: Altura de píxel

source: The size of the map image in pixels along the j axis
am: በ j ዘንግ ላይ ያለው የካርታ ምስል መጠን በፒክሰሎች ውስጥ
ar: حجم صورة الخريطة بالبكسل على طول المحور j
es: El tamaño de la imagen del mapa en píxeles a lo largo del eje j.

source: Transparency
am: ግልጽነት
ar: الشفافية
es: Transparencia

source: Ability of underlying maps to be visible or not
am: የስር ካርታዎች የመታየት ወይም ያለመታየት ችሎታ
ar: إمكانية أن تكون الخرائط الأساسية مرئية أم لا
es: Capacidad de los mapas subyacentes para ser visibles o no.

source: Spatial Reference System
am: የቦታ ማመሳከሪያ ስርዓት
ar: نظام الإسناد المكاني
es: Sistema de referencia espacial

source: WMS Spatial Reference e.g EPSG:3857
am: የWMS ቦታ ማጣቀሻ ለምሳሌ EPSG፡3857
ar: الإسناد المكاني لـ WMS، على سبيل المثال EPSG:3857
es: Referencia espacial WMS, por ejemplo, EPSG:3857

source: Output Format
am: የውጤት ቅርጸት
ar: تنسيق الإخراج
es: Formato de salida

source: Allowed map formats are either “picture” formats or “graphic element” formats.
am: የተፈቀዱ የካርታ ቅርጸቶች የ"ስዕል" ቅርጸቶች ወይም "ግራፊክ ኤለመንት" ቅርጸቶች ናቸው።
ar: تنسيقات الخريطة المسموح بها هي إما تنسيقات "صورة" أو تنسيقات "عناصر رسومية".
es: Los formatos de mapas permitidos son formatos de “imagen” o formatos de “elementos gráficos”.

source: WMS Query Params With selectable Options
am: የWMS መጠይቅ ፓራሞች ከተመረጡ አማራጮች ጋር
ar: معلمات استعلام WMS مع خيارات قابلة للتحديد
es: Parámetros de consulta WMS con opciones seleccionables

source: Get Capabilities URL
am: የችሎታዎችን URL ያግኙ
ar: الحصول على عنوان URL للقدرات
es: Obtener URL de capacidades

source: Alternative URL for the GetCapabilities request. Used when 'Request time from capabilities' option is checked. Leave blank to use base url.
am: ለ GetCapabilities ጥያቄ ተለዋጭ ዩአርኤል። 'ከችሎታዎች ጊዜ መጠየቅ' አማራጭ ሲፈተሽ ጥቅም ላይ ይውላል። ቤዝ url ለመጠቀም ባዶ ይተው።
ar: عنوان URL البديل لطلب GetCapabilities. يُستخدم عند تحديد خيار "طلب الوقت من القدرات". اتركه فارغًا لاستخدام عنوان URL الأساسي.
es: URL alternativa para la solicitud GetCapabilities. Se utiliza cuando la opción 'Solicitar tiempo de capacidades' está marcada. Déjelo en blanco para usar la URL base.

source: Get Capabilities Layer Name
am: የችሎታዎች የንብርብር ስም ያግኙ
ar: الحصول على اسم طبقة القدرات
es: Obtener nombre de capa de capacidades

source: Alternative layer name for the GetCapabilities request
am: ለ GetCapabilities ጥያቄ ተለዋጭ የንብርብር ስም
ar: اسم الطبقة البديلة لطلب GetCapabilities
es: Nombre de capa alternativo para la solicitud GetCapabilities

source: WMS Layer
am: የ WMS ንብርብር
ar: طبقة WMS
es: Capa WMS

source: WMS Layers
am: WMS ንብርብሮች
ar: طبقات WMS
es: Capas WMS

source: WMS Request Layers
am: የWMS ጥያቄ ንብርብሮች
ar: طبقات طلب WMS
es: Capas de solicitud WMS

source: WMS Request Layer
am: የWMS ጥያቄ ንብርብር
ar: طبقة طلب WMS
es: Capa de solicitud WMS

source: WMS Request Styles
am: የWMS ጥያቄ ቅጦች
ar: أنماط طلب WMS
es: Estilos de solicitud WMS

source: WMS Request Style
am: የWMS ጥያቄ ዘይቤ
ar: نمط طلب WMS
es: Estilo de solicitud WMS

source: WMS Request Additional Parameters
am: የWMS ተጨማሪ መለኪያዎችን ይጠይቁ
ar: طلب WMS معلمات إضافية
es: WMS solicita parámetros adicionales

source: WMS Request Param
am: የWMS ጥያቄ ፓራም
ar: معلمة طلب WMS
es: Parámetro de solicitud WMS

source: WMS GetMap Configuration
am: የWMS GetMap ውቅር
ar: تكوين WMS GetMap
es: Configuración de WMS GetMap

source: WMS GetCapabilities Configuration
am: የWMS GetCapabilities ውቅር
ar: تكوين WMS GetCapabilities
es: Configuración de WMS GetCapabilities

source: WMS Layer is requested by using this name in the LAYERS parameter of a GetMap request.
am: የWMS ንብርብር የተጠየቀው ይህንን ስም በ LAYERS የGetMap ጥያቄ መለኪያ በመጠቀም ነው።
ar: يتم طلب طبقة WMS باستخدام هذا الاسم في معلمة LAYERS لطلب GetMap.
es: La capa WMS se solicita utilizando este nombre en el parámetro LAYERS de una solicitud GetMap.

source: The style's Name is used in the Map request STYLES parameter
am: የቅጡ ስም በካርታ ጥያቄ STYLES ግቤት ውስጥ ጥቅም ላይ ይውላል
ar: يتم استخدام اسم النمط في معلمة STYLES لطلب الخريطة
es: El nombre del estilo se utiliza en el parámetro ESTILOS de solicitud de mapa.

source: WMS Requests Additional Parameters
am: WMS ተጨማሪ መለኪያዎችን ይጠይቃል
ar: تطلب WMS معلمات إضافية
es: WMS solicita parámetros adicionales

source: Name of the parameter
am: የመለኪያው ስም
ar: اسم المعلمة
es: Nombre del parámetro

source: Value of the parameter
am: የመለኪያው ዋጋ
ar: قيمة المعلمة
es: Valor del parámetro

source: WMS Request Parameter
am: የWMS ጥያቄ ልኬት
ar: معلمة طلب WMS
es: Parámetro de solicitud WMS

source: WMS Request Parameters
am: የWMS ጥያቄ መለኪያዎች
ar: معلمات طلب WMS
es: Parámetros de solicitud WMS

source: Data Variable : %(data_var)s
am: ተለዋዋጭ ውሂብ፡ %(data_var)s
ar: متغير البيانات : %(data_var)s
es: Variables de datos: %(data_var)s

source: Publish
am: አትም
ar: ينشر
es: Publicar

source: Delete
am: ሰርዝ
ar: يمسح
es: Borrar

source: Preview Layer %(title)s
am: ንብርብር %(title)s ቅድመ እይታ
ar: معاينة الطبقة %(title)s
es: Vista previa de capa %(title)s

source: Preview
am: ቅድመ እይታ
ar: معاينة
es: Avance

source: Back to Layers
am: ወደ ንብርብሮች ተመለስ
ar: العودة إلى الطبقات
es: Volver a capas

source: Back to Datasets
am: ወደ የውሂብ ስብስቦች ተመለስ
ar: العودة إلى مجموعات البيانات
es: Volver a conjuntos de datos

source: Select Layer
am: ንብርብር ይምረጡ
ar: حدد طبقة
es: Seleccionar capa

source: Time
am: ጊዜ
ar: وقت
es: Tiempo

source: Color Scale
am: የቀለም መለኪያ
ar: مقياس اللون
es: Escala de colores

source: Upload Raster %(title)s
am: ራስተር %(title)s ሰቀል
ar: تحميل البيانات النقطية %(title)s
es: Cargar %(title)s de ráster

source: Upload Raster Files
am: ራስተር ፋይሎችን ይስቀሉ
ar: تحميل الملفات النقطية
es: Cargar archivos ráster

source: Go to Map preview
am: ወደ ካርታ ቅድመ እይታ ይሂዱ
ar: انتقل إلى معاينة الخريطة
es: Ir a la vista previa del mapa

source: Drag and drop a raster file into this area to upload immediately
am: ወዲያውኑ ለመስቀል የራስተር ፋይልን ወደዚህ አካባቢ ጎትተው ይጣሉት።
ar: قم بسحب وإسقاط الملف النقطي في هذه المنطقة لتحميله على الفور
es: Arrastre y suelte un archivo ráster en esta área para cargarlo inmediatamente

source: Or choose from your computer
am: ወይም ከኮምፒዩተርዎ ይምረጡ
ar: أو اختر من جهاز الكمبيوتر الخاص بك
es: O elige desde tu computadora

source: Upload successful. Please update this file with required details and publish. You may also delete the file completely if the upload wasn't required.
am: ሰቀላው ተሳክቷል። እባክዎ ይህን ፋይል ከሚያስፈልጉ ዝርዝሮች ጋር ያዘምኑ እና ያትሙ። ሰቀላው አስፈላጊ ካልሆነ ፋይሉን ሙሉ በሙሉ መሰረዝ ይችላሉ።
ar: تحميل ناجح. يرجى تحديث هذا الملف بالتفاصيل المطلوبة ونشره. يمكنك أيضًا حذف الملف بالكامل إذا لم يكن التحميل مطلوبًا.
es: Subida exitosa. Actualice este archivo con los detalles requeridos y publíquelo. También puede eliminar el archivo por completo si no fue necesario cargarlo.

source: Sorry, upload failed.
am: ይቅርታ፣ ሰቀላው አልተሳካም።
ar: عذرًا، فشل التحميل.
es: Lo sentimos, la carga falló.

source: Server Error
am: የአገልጋይ ስህተት
ar: خطأ في الخادم
es: Error del Servidor

source: Report this error to your website administrator with the following information:
am: በሚከተለው መረጃ ይህንን ስህተት ለድር ጣቢያዎ አስተዳዳሪ ያሳውቁ።
ar: أبلغ عن هذا الخطأ إلى مسؤول موقع الويب الخاص بك بالمعلومات التالية:
es: Informe este error al administrador de su sitio web con la siguiente información:

source: File updated.
am: ፋይል ተዘምኗል።
ar: تم تحديث الملف.
es: Archivo actualizado.

source: Preview Layers %(title)s
am: ንብርብሮችን %(title)s ቅድመ ዕይታ
ar: معاينة الطبقات %(title)s
es: Vista previa de capas %(title)s

source: Stations Data %(title)s
am: የጣቢያዎች ውሂብ %(title)s
ar: بيانات المحطات %(title)s
es: Estaciones Datos %(title)s

source: Stations Data
am: የጣቢያዎች ውሂብ
ar: بيانات المحطات
es: Datos de estaciones

source: Load Stations
am: የመጫኛ ጣቢያዎች
ar: محطات التحميل
es: Estaciones de carga

source: Data Fields
am: የውሂብ መስኮች
ar: حقول البيانات
es: Campos de información

source: Field
am: መስክ
ar: مجال
es: Campo

source: Show in Table
am: በሰንጠረዡ ውስጥ አሳይ
ar: عرض في الجدول
es: Mostrar en la tabla

source: Show in Map Popup
am: በካርታ ብቅ ባይ ውስጥ አሳይ
ar: عرض في الخريطة المنبثقة
es: Mostrar en la ventana emergente del mapa

source: Save
am: አስቀምጥ
ar: يحفظ
es: Ahorrar

source: No station data loaded.
am: ምንም የጣቢያ ውሂብ አልተጫነም።
ar: لم يتم تحميل بيانات المحطة.
es: No hay datos de estación cargados.

source: Please
am: አባክሽን
ar: لو سمحت
es: Por favor

source: load station data
am: የመጫኛ ጣቢያ ውሂብ
ar: بيانات محطة التحميل
es: datos de la estación de carga

source: to preview
am: በቅድመ-እይታ
ar: للمعاينة
es: para previsualizar

source: Stations Loader %(title)s
am: የጣቢያዎች ጫኝ %(title)s
ar: محمل المحطات %(title)s
es: Cargador de estaciones %(title)s

source: Stations Loader
am: ጣቢያዎች ጫኝ
ar: محمل المحطات
es: Cargador de estaciones

source: Upload
am: ስቀል
ar: رفع
es: Subir

source: Show in Popup
am: በብቅ-ባይ አሳይ
ar: عرض في النافذة المنبثقة
es: Mostrar en ventana emergente

source: Upload Vector %(title)s
am: ቬክተር %(title)s ሰቀል
ar: تحميل المتجهات %(title)s
es: Cargar %(title)s vectoriales

source: Upload Vector Files
am: የቬክተር ፋይሎችን ይስቀሉ
ar: تحميل ملفات المتجهات
es: Cargar archivos vectoriales

source: Drag and drop a vector file into this area to upload immediately.
am: ወዲያውኑ ለመስቀል የቬክተር ፋይል ወደዚህ አካባቢ ይጎትቱ እና ይጣሉት።
ar: قم بسحب وإسقاط ملف المتجه في هذه المنطقة لتحميله على الفور.
es: Arrastre y suelte un archivo vectorial en esta área para cargarlo inmediatamente.

source: Select Color
am: ቀለም ይምረጡ
ar: إختر لون
es: Seleccionar el color

source: Legend Preview
am: አፈ ታሪክ ቅድመ እይታ
ar: معاينة الأسطورة
es: Vista previa de leyenda

source: Download XLSX
am: XLSX አውርድ
ar: تحميل XLSX
es: Descargar XLSX

source: Download CSV
am: CSV አውርድ
ar: قم بتنزيل ملف CSV
es: Descargar CSV

source: Filter
am: አጣራ
ar: منقي
es: Filtrar

source: No %(name)s have been created yet. One of the following must be created before you can add any %(name)s:
am: እስካሁን ምንም %(name)s አልተፈጠሩም። ማንኛውንም %(name)s ከማከልዎ በፊት ከሚከተሉት ውስጥ አንዱ መፈጠር አለበት፡
ar: لم يتم إنشاء %(name)s حتى الآن. يجب إنشاء واحد مما يلي قبل أن تتمكن من إضافة أي %(name)s:
es: Aún no se han creado %(name)s. Se debe crear uno de los siguientes antes de poder agregar %(name)s:

source: No %(name)s have been created yet.
am: እስካሁን ምንም %(name)s አልተፈጠሩም።
ar: لم يتم إنشاء %(name)s حتى الآن.
es: Aún no se han creado %(name)s.

source: Pagination
am: ፔጅኒሽን
ar: ترقيم الصفحات
es: Paginación

source: Page %(current_page)s of %(num_pages)s.
am: ገጽ %(current_page)s ከ%(num_pages)s ዎች።
ar: الصفحة %(current_page)s من %(num_pages)s.
es: Página %(current_page)s de %(num_pages)s.

source: No shapefile found in provided zip file
am: በዚፕ ፋይል ውስጥ ምንም የቅርጽ ፋይል አልተገኘም።
ar: لم يتم العثور على ملف شكل في الملف المضغوط المقدم
es: No se encontró ningún archivo de forma en el archivo zip proporcionado
