Repository: pypi-data/pypi-mirror-381
Catalog: packages/geomanager/geomanager-0.5.8-py3-none-any.whl/geomanager/locale/*/LC_MESSAGES/django.po
Languages: am, ar, es

source: No .shx file found in provided zip file
am: በዚፕ ፋይል ውስጥ ምንም .shx ፋይል አልተገኘም።
ar: لم يتم العثور على ملف .shx في الملف المضغوط المقدم
es: No se encontró ningún archivo .shx en el archivo zip proporcionado

source: No .dbf file found in provided zip file
am: በዚፕ ፋይል ውስጥ ምንም .dbf ፋይል አልተገኘም።
ar: لم يتم العثور على ملف .dbf في الملف المضغوط المقدم
es: No se encontró ningún archivo .dbf en el archivo zip proporcionado

source: Unsupported file type
am: የማይደገፍ የፋይል አይነት
ar: نوع ملف غير مدعوم
es: Tipo de archivo no soportado

source: Invalid geometry type. Expected one of %(valid_geom_types)s. Not %(geom_type)s
am: ልክ ያልሆነ የጂኦሜትሪ አይነት። የሚጠበቀው ከ%(valid_geom_types)s አንዱ ነው። %(geom_type)s አይደለም።
ar: نوع الشكل الهندسي غير صالح. المتوقع واحد من %(valid_geom_types)s. ليس %(geom_type)s
es: Tipo de geometría no válido. Se esperaba uno de %(valid_geom_types)s. No %(geom_type)s

source: Geometry Type validation not implemented for format %(vector_format)s
am: የጂኦሜትሪ አይነት ማረጋገጫ ለ %(vector_format)s ቅርጸት አልተተገበረም።
ar: لم يتم تنفيذ التحقق من صحة النوع الهندسي للتنسيق %(vector_format)s
es: Validación del tipo de geometría no implementada para el formato %(vector_format)s

source: Not a supported raster format. Supported formats: %(supported_formats)s.
am: የሚደገፍ ራስተር ቅርጸት አይደለም። የሚደገፉ ቅርጸቶች፡ %(supported_formats)s።
ar: ليس تنسيقًا نقطيًا مدعومًا. التنسيقات المدعومة: %(supported_formats)s.
es: No es un formato ráster compatible. Formatos admitidos: %(supported_formats)s.

source: This file is too big (%(file_size)s). Maximum filesize %(max_filesize)s. You can adjust the Maximum upload file size under Geomanager settings
am: ይህ ፋይል በጣም ትልቅ ነው (%(file_size)s)። ከፍተኛው %(max_filesize)s። ከፍተኛውን የሰቀላ ፋይል መጠን በጂኦማናጀር መቼቶች ማስተካከል ይችላሉ።
ar: هذا الملف كبير جدًا (%(file_size)s). الحد الأقصى للحجم %(max_filesize)s. يمكنك ضبط الحد الأقصى لحجم ملف التحميل ضمن إعدادات Geomanager
es: Este archivo es demasiado grande (%(file_size)s). Tamaño máximo del tamaño %(max_filesize)s. Puede ajustar el tamaño máximo del archivo de carga en la configuración de Geomanager

source: This file is too big. Maximum filesize %(max_filesize)s. You can adjust the Maximum upload file size under Geomanager settings.
am: ይህ ፋይል በጣም ትልቅ ነው። ከፍተኛው %(max_filesize)s። ከፍተኛውን የሰቀላ ፋይል መጠን በጂኦማናጀር መቼቶች ማስተካከል ይችላሉ።
ar: هذا الملف كبير جدًا. الحد الأقصى للحجم %(max_filesize)s. يمكنك ضبط الحد الأقصى لحجم ملف التحميل ضمن إعدادات Geomanager.
es: Este archivo es demasiado grande. Tamaño máximo del tamaño %(max_filesize)s. Puede ajustar el tamaño máximo del archivo de carga en la configuración de Geomanager.

source: You have set to clip uploaded raster files to the country(s) boundary but the uploaded file is not within the set countries. Make sure the uploaded file is within your country/countries or disable 'Crop raster to country' option in Geomanager settings
am: የተሰቀሉ ራስተር ፋይሎችን ወደ ሀገር(ዎች) ወሰን ለመቁረጥ አዘጋጅተዋል ነገር ግን የተሰቀለው ፋይል በተቀመጡት አገሮች ውስጥ አይደለም። የተሰቀለው ፋይል በአገርዎ/አገሮች ውስጥ መሆኑን ያረጋግጡ ወይም በጂኦማናጀር መቼቶች ውስጥ 'ራስን ወደ ሀገር ከርክም' የሚለውን አማራጭ ያሰናክሉ
ar: لقد قمت بضبط قص الملفات النقطية التي تم تحميلها إلى حدود الدولة (البلدان) ولكن الملف الذي تم تحميله ليس ضمن البلدان المحددة. تأكد من أن الملف الذي تم تحميله موجود داخل بلدك/بلدانك أو قم بتعطيل خيار "اقتصاص البيانات النقطية إلى البلد" في إعدادات Geomanager
es: Ha configurado recortar los archivos ráster cargados a los límites del país, pero el archivo cargado no se encuentra dentro de los países establecidos. Asegúrese de que el archivo cargado esté dentro de su país o países o deshabilite la opción 'Recortar ráster al país' en la configuración de Geomanager

source: Only POST allowed
am: POST ብቻ ነው የሚፈቀደው።
ar: يُسمح بالنشر فقط
es: Solo se permite PUBLICAR

source: upload not found
am: ሰቀላ አልተገኘም።
ar: لم يتم العثور على التحميل
es: carga no encontrada

source: File with date %(time_str)s already exists for layer %(db_layer)s
am: ቀን %(time_str)s ያለው ፋይል አስቀድሞ ንብርብ %(db_layer)s አለ።
ar: الملف ذو التاريخ %(time_str)s موجود بالفعل للطبقة %(db_layer)s
es: El archivo con fecha %(time_str)s ya existe para la capa %(db_layer)s

source: Error occurred. Try again
am: ስህተት ተከስቷል። እንደገና ሞክር
ar: حدث خطأ. حاول ثانية
es: Se produjo un error. Intentar otra vez

source: File with date %(time)s already exists for layer %(db_layer)s
am: ቀን %(time)s ያለው ፋይል አስቀድሞ ንብርብር %(db_layer)s አለ።
ar: الملف ذو التاريخ %(time)s موجود بالفعل للطبقة %(db_layer)s
es: El archivo con fecha %(time)s ya existe para la capa %(db_layer)s

source: File with date %(time)s already exists for selected layer
am: የቀን %(time)s ያለው ፋይል አስቀድሞ ለተመረጠው ንብርብር አለ።
ar: الملف ذو التاريخ %(time)s موجود بالفعل للطبقة المحددة
es: El archivo con fecha %(time)s ya existe para la capa seleccionada

source: time param required
am: የጊዜ መለኪያ ያስፈልጋል
ar: معلمة الوقت المطلوبة
es: parámetro de tiempo requerido

source: File not found matching 'layer': %(layer_id)s and 'time': %(time)s
am: ከ'layer': %(layer_id)s እና 'time': %(time)s ጋር የሚዛመድ ፋይል አልተገኘም
ar: لم يتم العثور على الملف المطابق لـ 'layer': %(layer_id)s و'time': %(time)s
es: Archivo no encontrado que coincida con 'capa': %(layer_id)s y 'tiempo': %(time)s

source: time_from or time_to param required
am: ሰዓት_ከወይም ሰዓት_ወደ ፓራም ያስፈልጋል
ar: مطلوب time_from أو time_to المعلمة
es: Se requiere el parámetro time_from o time_to

source: x param required
am: x ፓራም ያስፈልጋል
ar: المعلمة x مطلوبة
es: x parámetro requerido

source: y param required
am: y param ያስፈልጋል
ar: y المعلمة المطلوبة
es: y parámetro requerido

source: geostore_id param required
am: geostore_id param ያስፈልጋል
ar: المعلمة Geostore_id مطلوبة
es: parámetro geostore_id requerido

source: Geostore with id %(geostore_id)s does not exist
am: ጂኦስቶር ከመታወቂያ %(geostore_id)s ጋር የለም።
ar: المتجر الجغرافي بالمعرف %(geostore_id)s غير موجود
es: El geostore con id %(geostore_id)s no existe

source: Stations data loaded successfully
am: የጣቢያዎች ውሂብ በተሳካ ሁኔታ ተጭኗል
ar: تم تحميل بيانات المحطات بنجاح
es: Datos de estaciones cargados exitosamente

source: Stations columns updated successfully
am: የጣቢያዎች አምዶች በተሳካ ሁኔታ ተዘምነዋል
ar: تم تحديث أعمدة المحطات بنجاح
es: Columnas de estaciones actualizadas exitosamente

source: Not a supported vector format. Supported formats: %(supported_formats)s.
am: የሚደገፍ የቬክተር ቅርጸት አይደለም። የሚደገፉ ቅርጸቶች፡ %(supported_formats)s።
ar: ليس تنسيق ناقل معتمد. التنسيقات المدعومة: %(supported_formats)s.
es: No es un formato vectorial compatible. Formatos admitidos: %(supported_formats)s.

source: This file is too big (%(file_size)s). Maximum filesize %(max_filesize)s.
am: ይህ ፋይል በጣም ትልቅ ነው (%(file_size)s)። ከፍተኛው %(max_filesize)s።
ar: هذا الملف كبير جدًا (%(file_size)s). الحد الأقصى للحجم %(max_filesize)s.
es: Este archivo es demasiado grande (%(file_size)s). Tamaño máximo del tamaño %(max_filesize)s.

source: This file is too big. Maximum filesize %(max_filesize)s.
am: ይህ ፋይል በጣም ትልቅ ነው። ከፍተኛው %(max_filesize)s።
ar: هذا الملف كبير جدًا. الحد الأقصى للحجم %(max_filesize)s.
es: Este archivo es demasiado grande. Tamaño máximo del tamaño %(max_filesize)s.

source: Data fields updated successfully
am: የውሂብ መስኮች በተሳካ ሁኔታ ዘምነዋል
ar: تم تحديث حقول البيانات بنجاح
es: Campos de datos actualizados exitosamente

source: Data Categories
am: የውሂብ ምድቦች
ar: فئات البيانات
es: Categorías de datos

source: View Datasets
am: የውሂብ ስብስቦችን ይመልከቱ
ar: عرض مجموعات البيانات
es: Ver conjuntos de datos

source: Create from categories
am: ከምድብ ፍጠር
ar: إنشاء من الفئات
es: Crear a partir de categorías

source: View Layers
am: ንብርብሮችን ይመልከቱ
ar: عرض الطبقات
es: Ver capas

source: Upload Files
am: ፋይሎችን ይስቀሉ
ar: تحميل الملفات
es: Subir archivos

source: Edit Category
am: ምድብ አርትዕ
ar: تحرير الفئة
es: Editar categoria

source: Layers
am: ንብርብሮች
ar: طبقات
es: Capas

source: Preview Dataset
am: የውሂብ ስብስብ ቅድመ ዕይታ
ar: معاينة مجموعة البيانات
es: Vista previa del conjunto de datos

source: Create from datasets
am: ከውሂብ ስብስቦች ይፍጠሩ
ar: إنشاء من مجموعات البيانات
es: Crear a partir de conjuntos de datos

source: File Layers
am: የፋይል ንብርብሮች
ar: طبقات الملف
es: Capas de archivos

source: Uploaded Files
am: የተጫኑ ፋይሎች
ar: الملفات التي يتم تحميلها
es: Archivos subidos

source: Preview on Map
am: በካርታ ላይ ቅድመ-እይታ
ar: معاينة على الخريطة
es: Vista previa en el mapa

source: View Uploaded Files
am: የተጫኑ ፋይሎችን ይመልከቱ
ar: عرض الملفات المرفوعة
es: Ver archivos cargados

source: Preview Layer
am: ቅድመ እይታ ንብርብር
ar: طبقة المعاينة
es: Vista previa de capa

source: Color Preview
am: የቀለም ቅድመ እይታ
ar: معاينة اللون
es: Vista previa de color

source: Vector Layers
am: የቬክተር ንብርብሮች
ar: طبقات المتجهات
es: Capas vectoriales

source: Boundary Settings
am: የድንበር ቅንጅቶች
ar: إعدادات الحدود
es: Configuración de límites

source: Boundary Data
am: የድንበር ውሂብ
ar: بيانات الحدود
es: Datos de límites

source: Settings
am: ቅንብሮች
ar: إعدادات
es: Ajustes

source: dataset
am: የውሂብ ስብስብ
es: conjunto de datos
