Repository: pypi-data/pypi-mirror-381
Catalog: packages/geomanager/geomanager-0.5.8.tar.gz/geomanager-0.5.8/geomanager/locale/*/LC_MESSAGES/django.po
Languages: fr, sw

source: Can not add layer because the dataset is not marked as Multi Layer. To add multiple layers to a dataset, please mark the dataset as Multi Layer and try again
fr: Impossible d'ajouter une couche car l'ensemble de données n'est pas marqué comme multicouche. Pour ajouter plusieurs couches à un ensemble de données, veuillez marquer l'ensemble de données comme multicouche et réessayer.
sw: Haiwezi kuongeza safu kwa sababu mkusanyiko wa data haujawekwa alama kama Tabaka Nyingi. Ili kuongeza safu nyingi kwenye mkusanyiko wa data, tafadhali weka alama kwenye mkusanyiko wa data kama Tabaka Nyingi na ujaribu tena

source: file
fr: déposer
sw: faili

source: Layer Raster File
fr: Fichier raster de couche
sw: Faili ya Raster ya Tabaka

source: Layer Raster Files
fr: Fichiers raster de calques
sw: Faili za Raster za Tabaka

source: Raster Upload
fr: Téléchargement de raster
sw: Upakiaji wa Raster

source: Raster Uploads
fr: Téléchargements raster
sw: Upakiaji wa Raster

source: Style name for identification
fr: Nom du style pour identification
sw: Jina la mtindo kwa kitambulisho

source: data unit
fr: unité de données
sw: kitengo cha data

source: minimum value
fr: valeur minimum
sw: thamani ya chini

source: maximum value
fr: valeur maximum
sw: thamani ya juu

source: steps
fr: pas
sw: hatua

source: Number of steps
fr: Nombre d'étapes
sw: Idadi ya hatua

source: Use Custom Colors
fr: Utiliser des couleurs personnalisées
sw: Tumia Rangi Maalum

source: Color Palette
fr: Palette de couleurs
sw: Palette ya rangi

source: Color for the rest of values
fr: Couleur pour le reste des valeurs
sw: Rangi kwa thamani zingine

source: Color for values greater than the values defined above, as well as values greater than the maximum defined value
fr: Couleur pour les valeurs supérieures aux valeurs définies ci-dessus, ainsi que les valeurs supérieures à la valeur maximale définie
sw: Rangi kwa thamani kubwa kuliko zile zilizofafanuliwa hapo juu, pamoja na thamani kubwa zaidi ya thamani ya juu iliyobainishwa

source: Raster Style
fr: Style raster
sw: Mtindo wa Raster

source: Raster Styles
fr: Styles raster
sw: Mitindo ya Raster

source: Data values
fr: Valeurs des données
sw: Thamani za data

source: Color Values
fr: Valeurs de couleur
sw: Maadili ya Rangi

source: Color Value
fr: Valeur de couleur
sw: Thamani ya Rangi

source: Custom Color Values
fr: Valeurs de couleur personnalisées
sw: Maadili Maalum ya Rangi

source: Threshold value
fr: Valeur de seuil
sw: Thamani ya kizingiti

source: Values less than or equal to the input value, will be assigned the chosen color
fr: Les valeurs inférieures ou égales à la valeur d'entrée se verront attribuer la couleur choisie
sw: Thamani zilizo chini ya au sawa na thamani ya ingizo, zitapewa rangi iliyochaguliwa

source: Label for Legend
fr: Étiquette pour la légende
sw: Lebo ya Legend

source: Raster Tile Layer
fr: Couche de tuiles raster
sw: Safu ya Tile ya Raster

source: Raster Tile Layers
fr: Couches de tuiles raster
sw: Tabaka za Tile Raster

source: Base Tile url
fr: URL de la tuile de base
sw: Url ya Kigae cha Msingi

source: Query Parameter
fr: Paramètre de requête
sw: Kigezo cha hoja

source: Static Query Params
fr: Paramètres de requête statiques
sw: Vigezo vya Maswali Tuli

source: Static query params to be added to the url
fr: Paramètres de requête statiques à ajouter à l'URL
sw: Vigezo vya hoja tuli vya kuongezwa kwenye url

source: Selectable Query Parameter
fr: Paramètre de requête sélectionnable
sw: Kigezo cha Maswali Inayoweza Kuchaguliwa

source: Query Params With selectable Options
fr: Paramètres de requête avec options sélectionnables
sw: Vigezo vya Kuuliza Na Chaguzi zinazoweza kuchaguliwa

source: This should provide a list of options that users can choose to change the query parameter of the url
fr: Cela devrait fournir une liste d'options que les utilisateurs peuvent choisir pour modifier le paramètre de requête de l'URL.
sw: Hii inapaswa kutoa orodha ya chaguo ambazo watumiaji wanaweza kuchagua kubadilisha kigezo cha hoja cha url

source: Arrange Param Selectors side by side
fr: Disposer les sélecteurs de paramètres côte à côte
sw: Panga Viteuzi vya Param kando

source: Custom Legend
fr: Légende personnalisée
sw: Hadithi Maalum

source: Custom Image
fr: Image personnalisée
sw: Picha Maalum

source: Legend Icon
fr: Icône de légende
sw: Aikoni ya Hadithi

source: Legend
fr: Légende
sw: Hadithi

source: Info link
fr: Lien d'information
sw: Kiungo cha habari

source: More Info
fr: Plus d'informations
sw: Maelezo Zaidi

source: Get time from tile json url
fr: Obtenir l'heure à partir de l'URL JSON de la tuile
sw: Pata muda kutoka kwa tile json url

source: Tile JSON url
fr: URL JSON de la vignette
sw: Weka url ya JSON

source: Timestamps response object key
fr: Clé d'objet de réponse d'horodatage
sw: Kitufe cha majibu ya mihuri ya saa

source: Key for timestamps values in response object
fr: Clé pour les valeurs d'horodatage dans l'objet de réponse
sw: Ufunguo wa thamani za mihuri ya muda katika kitu cha kujibu

source: TileJson Settings
fr: Paramètres TileJson
sw: Mipangilio ya TileJson

source: Style Name
fr: Nom du style
sw: Jina la Mtindo

source: Use default style
fr: Utiliser le style par défaut
sw: Tumia mtindo chaguo-msingi

source: OpenMapTiles style
fr: Style OpenMapTiles
sw: Mtindo wa OpenMapTiles

source: Basemap Source
fr: Source du fond de carte
sw: Chanzo cha Basemap

source: Basemap Sources
fr: Sources du fond de carte
sw: Vyanzo vya Ramani ya Msingi

source: Polygon Layer
fr: Couche de polygone
sw: Tabaka la poligoni

source: Line Layer
fr: Couche de lignes
sw: Safu ya Mstari

source: Point Layer
fr: Couche de points
sw: Tabaka la Pointi

source: Icon Layer
fr: Couche d'icônes
sw: Safu ya ikoni

source: Text Label Layer
fr: Calque d'étiquette de texte
sw: Tabaka la Lebo ya maandishi

source: Render Layers
fr: Rendu des calques
sw: Tabaka za Mpeni

source: Legend Image
fr: Image de légende
sw: Picha ya Hadithi

source: Vector File Layer
fr: Couche de fichier vectoriel
sw: Safu ya Faili ya Vector

source: Vector File Layers
fr: Calques de fichiers vectoriels
sw: Tabaka za Faili za Vector

source: Vector Layer Icon
fr: Icône de couche vectorielle
sw: Ikoni ya Tabaka la Vekta

source: Vector Layer Icons
fr: Icônes de couche vectorielle
sw: Aikoni za Tabaka la Vekta

source: Vector Upload
fr: Téléchargement de vecteur
sw: Upakiaji wa Vekta

source: Vector Uploads
fr: Téléchargements de vecteurs
sw: Upakiaji wa Vekta

source: time for the dataset
fr: temps pour l'ensemble de données
sw: muda wa mkusanyiko wa data

source: source layer
fr: couche source
sw: safu ya chanzo

source: Vector Tile Layer
fr: Couche de tuiles vectorielles
sw: Safu ya Tile ya Vector

source: Vector Tile Layers
fr: Couches de tuiles vectorielles
sw: Tabaka za Tile za Vector

source: Hourly - (E.g 2023-01-01 00:00)
fr: Horaire - (par exemple, 01/01/2023 00:00)
sw: Kila Saa - (Mf 2023-01-01 00:00)

source: Daily - (E.g 2023-01-01)
fr: Quotidien - (par exemple 2023-01-01)
sw: Kila siku - (Mf 2023-01-01)

source: Monthly - (E.g 2023-01)
fr: Mensuel - (par exemple 2023-01)
sw: Kila mwezi - (Mf 2023-01)

source: Monthly - (E.g January 2023)
fr: Mensuel - (par exemple janvier 2023)
sw: Kila mwezi - (Mf. Januari 2023)

source: Pentadal - (E.g Jan 2023 - P1 1-5th)
fr: Pentadal - (par exemple janvier 2023 - P1 1-5)
sw: Pentadal - (Mf. Januari 2023 - P1 1-5th)

source: Request time from capabilities
fr: Demander du temps aux capacités
sw: Omba muda kutoka kwa uwezo

source: Get list of available times for this layer from getCapabilities
fr: Obtenez la liste des heures disponibles pour cette couche à partir de getCapabilities
sw: Pata orodha ya nyakati zinazopatikana za safu hii kutoka kwa GetCapabilities

source: base url for WMS
fr: URL de base pour WMS
sw: url ya msingi ya WMS

source: WMS Version
fr: Version WMS
sw: Toleo la WMS

source: Pixel Width
fr: Largeur des pixels
sw: Upana wa Pixel

source: The size of the map image in pixels along the i axis
fr: La taille de l'image de la carte en pixels le long de l'axe i
sw: Ukubwa wa picha ya ramani katika saizi kwenye mhimili wa i

source: Pixel Height
fr: Hauteur des pixels
sw: Urefu wa Pixel

source: The size of the map image in pixels along the j axis
fr: La taille de l'image de la carte en pixels le long de l'axe j
sw: Ukubwa wa picha ya ramani katika saizi kwenye mhimili wa j

source: Transparency
fr: Transparence
sw: Uwazi

source: Ability of underlying maps to be visible or not
fr: Capacité des cartes sous-jacentes à être visibles ou non
sw: Uwezo wa ramani za msingi kuonekana au la

source: Spatial Reference System
fr: Système de référence spatiale
sw: Mfumo wa Marejeleo ya anga

source: WMS Spatial Reference e.g EPSG:3857
fr: Référence spatiale WMS, par exemple EPSG : 3857
sw: Marejeleo ya anga ya WMS k.m EPSG:3857

source: Output Format
fr: Format de sortie
sw: Umbizo la Pato

source: Allowed map formats are either “picture” formats or “graphic element” formats.
fr: Les formats de carte autorisés sont soit les formats « image », soit les formats « élément graphique ».
sw: Miundo ya ramani inayoruhusiwa ni umbizo la "picha" au miundo ya "kipengele cha picha".

source: WMS Query Params With selectable Options
fr: Paramètres de requête WMS avec options sélectionnables
sw: Vigezo vya Maswali ya WMS Na Chaguzi zinazoweza kuchaguliwa

source: Get Capabilities URL
fr: Obtenir l'URL des fonctionnalités
sw: Pata URL ya Uwezo

source: Alternative URL for the GetCapabilities request. Used when 'Request time from capabilities' option is checked. Leave blank to use base url.
fr: URL alternative pour la requête GetCapabilities. Utilisé lorsque l'option « Demander l'heure aux capacités » est cochée. Laissez vide pour utiliser l’URL de base.
sw: URL mbadala ya ombi la GetCapabilities. Inatumika wakati chaguo la 'Omba muda kutoka kwa uwezo' limechaguliwa. Acha wazi ili kutumia url ya msingi.

source: Get Capabilities Layer Name
fr: Obtenir le nom de la couche de capacités
sw: Pata Jina la Tabaka la Uwezo

source: Alternative layer name for the GetCapabilities request
fr: Nom de couche alternatif pour la requête GetCapabilities
sw: Jina la safu mbadala kwa ombi la GetCapabilities

source: WMS Layer
fr: Couche WMS
sw: Safu ya WMS

source: WMS Layers
fr: Couches WMS
sw: Tabaka za WMS

source: WMS Request Layers
fr: Couches de requête WMS
sw: Tabaka za Ombi la WMS

source: WMS Request Layer
fr: Couche de requête WMS
sw: Tabaka la Ombi la WMS

source: WMS Request Styles
fr: Styles de requête WMS
sw: Mitindo ya Ombi la WMS

source: WMS Request Style
fr: Style de demande WMS
sw: Mtindo wa Ombi la WMS

source: WMS Request Additional Parameters
fr: Paramètres supplémentaires de la demande WMS
sw: WMS Ombi la Vigezo vya Ziada

source: WMS Request Param
fr: Paramètre de demande WMS
sw: Kigezo cha Ombi la WMS

source: WMS GetMap Configuration
fr: Configuration GetMap WMS
sw: Usanidi wa GetMap wa WMS

source: WMS GetCapabilities Configuration
fr: Configuration de GetCapabilities WMS
sw: Usanidi wa Uwezo wa Kupata Uwezo wa WMS

source: WMS Layer is requested by using this name in the LAYERS parameter of a GetMap request.
fr: La couche WMS est demandée en utilisant ce nom dans le paramètre LAYERS d'une requête GetMap.
sw: Safu ya WMS inaombwa kwa kutumia jina hili katika kigezo cha LAYERS cha ombi la GetMap.

source: The style's Name is used in the Map request STYLES parameter
fr: Le Nom du style est utilisé dans le paramètre STYLES de la requête Map.
sw: Jina la mtindo linatumika katika kigezo cha ombi la Ramani STYLES

source: WMS Requests Additional Parameters
fr: WMS demande des paramètres supplémentaires
sw: WMS Inaomba Vigezo vya Ziada

source: Name of the parameter
fr: Nom du paramètre
sw: Jina la kigezo

source: Value of the parameter
fr: Valeur du paramètre
sw: Thamani ya parameter

source: WMS Request Parameter
fr: Paramètre de requête WMS
sw: Kigezo cha Ombi la WMS

source: WMS Request Parameters
fr: Paramètres de requête WMS
sw: Vigezo vya Ombi la WMS

source: Data Variable : %(data_var)s
fr: Variable de données : %(data_var)s
sw: Kigezo cha Data : %(data_var)s

source: Publish
fr: Publier
sw: Kuchapisha

source: Delete
fr: Supprimer
sw: Futa

source: Preview Layer %(title)s
fr: Aperçu du calque %(title)s
sw: Hakiki Safu %(title)s

source: Preview
fr: Aperçu
sw: Hakiki

source: Back to Layers
fr: Retour aux calques
sw: Rudi kwa Tabaka

source: Back to Datasets
fr: Retour aux ensembles de données
sw: Rudi kwenye Hifadhidata

source: Select Layer
fr: Sélectionner un calque
sw: Chagua Tabaka

source: Time
fr: Temps
sw: Wakati

source: Color Scale
fr: Échelle de couleurs
sw: Kiwango cha Rangi

source: Upload Raster %(title)s
fr: Télécharger le raster %(title)s
sw: Pakia Raster %(title)s

source: Upload Raster Files
fr: Télécharger des fichiers raster
sw: Pakia Faili za Raster

source: Go to Map preview
fr: Accédez à l'aperçu de la carte
sw: Nenda kwenye onyesho la kukagua Ramani

source: Drag and drop a raster file into this area to upload immediately
fr: Faites glisser et déposez un fichier raster dans cette zone pour le télécharger immédiatement
sw: Buruta na udondoshe faili ya raster kwenye eneo hili ili upakie mara moja

source: Or choose from your computer
fr: Ou choisissez depuis votre ordinateur
sw: Au chagua kutoka kwa kompyuta yako

source: Upload successful. Please update this file with required details and publish. You may also delete the file completely if the upload wasn't required.
fr: Téléchargement réussi. Veuillez mettre à jour ce fichier avec les détails requis et le publier. Vous pouvez également supprimer complètement le fichier si le téléchargement n'était pas requis.
sw: Imepakia. Tafadhali sasisha faili hii kwa maelezo yanayohitajika na uchapishe. Unaweza pia kufuta faili kabisa ikiwa upakiaji haukuhitajika.

source: Sorry, upload failed.
fr: Désolé, le téléchargement a échoué.
sw: Samahani, upakiaji haukufaulu.

source: Server Error
fr: erreur du serveur
sw: Hitilafu ya Seva

source: Report this error to your website administrator with the following information:
fr: Signalez cette erreur à l'administrateur de votre site Web avec les informations suivantes :
sw: Ripoti hitilafu hii kwa msimamizi wa tovuti yako na maelezo yafuatayo:

source: File updated.
fr: Fichier mis à jour.
sw: Faili imesasishwa.

source: Preview Layers %(title)s
fr: Aperçu des calques %(title)s
sw: Hakiki Tabaka %(title)s

source: Stations Data %(title)s
fr: Données des stations %(title)s
sw: Data ya Vituo %(title)s

source: Stations Data
fr: Données des stations
sw: Data ya Vituo

source: Load Stations
fr: Stations de chargement
sw: Vituo vya Kupakia

source: Data Fields
fr: Champs de données
sw: Sehemu za Data

source: Field
fr: Champ
sw: Shamba

source: Show in Table
fr: Afficher dans le tableau
sw: Onyesha kwenye Jedwali

source: Show in Map Popup
fr: Afficher dans la fenêtre contextuelle de la carte
sw: Onyesha katika Dirisha Ibukizi la Ramani

source: Save
fr: Sauvegarder
sw: Hifadhi

source: No station data loaded.
fr: Aucune donnée de station chargée.
sw: Hakuna data ya kituo iliyopakiwa.

source: Please
fr: S'il te plaît
sw: Tafadhali

source: load station data
fr: données du poste de chargement
sw: pakia data ya kituo

source: to preview
fr: pour un aperçu
sw: kuhakiki

source: Stations Loader %(title)s
fr: Chargeur de stations %(title)s
sw: Kipakiaji cha Vituo %(title)s

source: Stations Loader
fr: Chargeur de stations
sw: Vituo vya Loader

source: Upload
fr: Télécharger
sw: Pakia

source: Show in Popup
fr: Afficher dans une fenêtre contextuelle
sw: Onyesha kwenye Dirisha Ibukizi

source: Upload Vector %(title)s
fr: Télécharger le vecteur %(title)s
sw: Pakia Vekta %(title)s

source: Upload Vector Files
fr: Télécharger des fichiers vectoriels
sw: Pakia Faili za Vekta

source: Drag and drop a vector file into this area to upload immediately.
fr: Faites glisser et déposez un fichier vectoriel dans cette zone pour le télécharger immédiatement.
sw: Buruta na udondoshe faili ya vekta kwenye eneo hili ili kupakia mara moja.

source: Select Color
fr: Choisissez la couleur
sw: Chagua Rangi

source: Legend Preview
fr: Aperçu de la légende
sw: Hakiki ya Hadithi

source: Download XLSX
fr: Télécharger XLSX
sw: Pakua XLSX

source: Download CSV
fr: Télécharger CSV
sw: Pakua CSV

source: Filter
fr: Filtre
sw: Chuja

source: No %(name)s have been created yet. One of the following must be created before you can add any %(name)s:
fr: Aucun %(name)s n'a encore été créé. L'un des éléments suivants doit être créé avant de pouvoir ajouter des %(name)s:
sw: Bado hakuna %(name)s zilizoundwa. Moja ya yafuatayo lazima iundwe kabla ya kuongeza %(name)s yoyote:

source: No %(name)s have been created yet.
fr: Aucun %(name)s n'a encore été créé.
sw: Bado hakuna %(name)s zilizoundwa.

source: Page %(current_page)s of %(num_pages)s.
fr: Page %(current_page)s sur %(num_pages)s.
sw: Ukurasa %(current_page)s wa %(num_pages)s.

source: No shapefile found in provided zip file
fr: Aucun fichier de formes trouvé dans le fichier zip fourni
sw: Hakuna faili ya umbo iliyopatikana katika faili ya zip iliyotolewa

source: No .shx file found in provided zip file
fr: Aucun fichier .shx trouvé dans le fichier zip fourni
sw: Hakuna faili ya .shx iliyopatikana katika faili ya zip iliyotolewa

source: No .dbf file found in provided zip file
fr: Aucun fichier .dbf trouvé dans le fichier zip fourni
sw: Hakuna faili ya .dbf iliyopatikana katika faili ya zip iliyotolewa

source: Unsupported file type
fr: Type de fichier non pris en charge
sw: Aina ya faili isiyotumika

source: Invalid geometry type. Expected one of %(valid_geom_types)s. Not %(geom_type)s
fr: Type de géométrie invalide. Attendu l'un des %(valid_geom_types)s. Pas %(geom_type)s
sw: Aina batili ya jiometri. Inatarajiwa moja kati ya %(valid_geom_types)s. Sio %(geom_type)s

source: Geometry Type validation not implemented for format %(vector_format)s
fr: La validation du type de géométrie n'est pas implémentée pour le format %(vector_format)s
sw: Uthibitishaji wa Aina ya Jiometri haujatekelezwa kwa umbizo %(vector_format)s

source: Not a supported raster format. Supported formats: %(supported_formats)s.
fr: Ce n'est pas un format raster pris en charge. Formats pris en charge : %(supported_formats)s.
sw: Sio umbizo la raster linalotumika. Miundo inayotumika: %(supported_formats)s.

source: This file is too big (%(file_size)s). Maximum filesize %(max_filesize)s. You can adjust the Maximum upload file size under Geomanager settings
fr: Ce fichier est trop volumineux (%(file_size)s). Taille de fichier maximale %(max_filesize)s. Vous pouvez ajuster la taille maximale du fichier de téléchargement dans les paramètres de Geomanager.
sw: Faili hii ni kubwa mno (%(file_size)s). Upeo wa ukubwa wa faili %(max_filesize)s. Unaweza kurekebisha Upeo wa ukubwa wa faili ya upakiaji chini ya mipangilio ya Geomanager

source: This file is too big. Maximum filesize %(max_filesize)s. You can adjust the Maximum upload file size under Geomanager settings.
fr: Ce fichier est trop gros. Taille de fichier maximale %(max_filesize)s. Vous pouvez ajuster la taille maximale du fichier de téléchargement dans les paramètres de Geomanager.
sw: Faili hii ni kubwa sana. Upeo wa ukubwa wa faili %(max_filesize)s. Unaweza kurekebisha Upeo wa ukubwa wa faili ya upakiaji chini ya mipangilio ya Geomanager.

source: You have set to clip uploaded raster files to the country(s) boundary but the uploaded file is not within the set countries. Make sure the uploaded file is within your country/countries or disable 'Crop raster to country' option in Geomanager settings
fr: Vous avez configuré le découpage des fichiers raster téléchargés selon les limites du ou des pays, mais le fichier téléchargé ne se trouve pas dans les pays définis. Assurez-vous que le fichier téléchargé se trouve dans votre/vos pays ou désactivez l'option « Recadrer le raster vers le pays » dans les paramètres de Geomanager.
sw: Umeweka klipu ya faili za raster zilizopakiwa kwenye mpaka wa nchi lakini faili iliyopakiwa haiko ndani ya nchi zilizowekwa. Hakikisha kuwa faili iliyopakiwa iko ndani ya nchi/nchi zako au zima chaguo la 'Punguza raster hadi nchi' katika mipangilio ya Geomanager.

source: Only POST allowed
fr: Seul le POST est autorisé
sw: POST pekee inaruhusiwa

source: upload not found
fr: téléchargement introuvable
sw: upakiaji haujapatikana

source: File with date %(time_str)s already exists for layer %(db_layer)s
fr: Le fichier avec la date %(time_str)s existe déjà pour la couche %(db_layer)s
sw: Faili yenye tarehe %(time_str)s tayari ipo kwa ajili ya safu %(db_layer)s

source: Error occurred. Try again
fr: Erreur est survenue. Essayer à nouveau
sw: Hitilafu imetokea. Jaribu tena

source: File with date %(time)s already exists for layer %(db_layer)s
fr: Le fichier avec la date %(time)s existe déjà pour la couche %(db_layer)s
sw: Faili yenye tarehe %(time)s tayari ipo kwa safu %(db_layer)s

source: File with date %(time)s already exists for selected layer
fr: Le fichier avec la date %(time)s existe déjà pour la couche sélectionnée
sw: Faili yenye tarehe %(time)s tayari ipo kwa safu iliyochaguliwa

source: time param required
fr: paramètre de temps requis
sw: param ya wakati inahitajika

source: File not found matching 'layer': %(layer_id)s and 'time': %(time)s
fr: Fichier introuvable correspondant à 'layer' : %(layer_id)s et 'time' : %(time)s
sw: Faili haijapatikana inayolingana na 'layer': %(layer_id)s na 'time': %(time)s

source: time_from or time_to param required
fr: paramètre time_from ou time_to requis
sw: time_from au time_to param inahitajika

source: x param required
fr: x paramètre requis
sw: x param inahitajika

source: y param required
fr: y paramètre requis
sw: y param inahitajika

source: geostore_id param required
fr: paramètre geostore_id requis
sw: geostore_id param inahitajika

source: Geostore with id %(geostore_id)s does not exist
fr: Le géostore avec l'identifiant %(geostore_id)s n'existe pas
sw: Geostore yenye id %(geostore_id)s haipo

source: Stations data loaded successfully
fr: Les données des stations ont été chargées avec succès
sw: Data ya vituo imepakiwa

source: Stations columns updated successfully
fr: Les colonnes des stations ont été mises à jour avec succès
sw: Safu wima za vituo zimesasishwa

source: Not a supported vector format. Supported formats: %(supported_formats)s.
fr: Ce n'est pas un format vectoriel pris en charge. Formats pris en charge : %(supported_formats)s.
sw: Sio umbizo la vekta linalotumika. Miundo inayotumika: %(supported_formats)s.

source: This file is too big (%(file_size)s). Maximum filesize %(max_filesize)s.
fr: Ce fichier est trop volumineux (%(file_size)s). Taille de fichier maximale %(max_filesize)s.
sw: Faili hii ni kubwa mno (%(file_size)s). Upeo wa ukubwa wa faili %(max_filesize)s.

source: This file is too big. Maximum filesize %(max_filesize)s.
fr: Ce fichier est trop gros. Taille de fichier maximale %(max_filesize)s.
sw: Faili hii ni kubwa sana. Upeo wa ukubwa wa faili %(max_filesize)s.

source: Data fields updated successfully
fr: Champs de données mis à jour avec succès
sw: Sehemu za data zimesasishwa

source: Data Categories
fr: Catégories de données
sw: Vitengo vya Data

source: View Datasets
fr: Afficher les ensembles de données
sw: Tazama Seti za Data

source: Create from categories
fr: Créer à partir de catégories
sw: Unda kutoka kwa kategoria

source: View Layers
fr: Afficher les calques
sw: Tazama Tabaka

source: Upload Files
fr: Télécharger des fichiers
sw: Pakia Faili

source: Edit Category
fr: Modifier la catégorie
sw: Badilisha Kategoria

source: Layers
fr: Couches
sw: Tabaka

source: Preview Dataset
fr: Aperçu de l'ensemble de données
sw: Hakiki Seti ya Data
