Repository: pypi-data/pypi-mirror-381
Catalog: packages/geomanager/geomanager-0.5.8.tar.gz/geomanager-0.5.8/geomanager/locale/*/LC_MESSAGES/django.po
Languages: fr, sw

source: Label
fr: Étiquette
sw: Lebo

source: Page
sw: Ukurasa

source: Internal page to navigate
fr: Page interne pour naviguer
sw: Ukurasa wa ndani wa kusogeza

source: External Link
fr: lien externe
sw: Kiungo cha mtandao cha Nje

source: External link to navigate to. Used if internal page not provided
fr: Lien externe vers lequel accéder. Utilisé si la page interne n'est pas fournie
sw: Kiungo cha mtandao cha nje. Inatumika ikiwa ukurasa wa ndani haujatolewa

source: Key
fr: Clé
sw: Ufunguo

source: Value
fr: Valeur
sw: Thamani

source: Radio
sw: Redio

source: Dropdown
fr: Dérouler
sw: Kunjuzi

source: name
fr: nom
sw: jina

source: label
fr: étiquette
sw: lebo

source: Selector Type
fr: Type de sélecteur
sw: Aina ya Kiteuzi

source: value
fr: valeur
sw: thamani

source: default
fr: défaut
sw: chaguo-msingi

source: Check to make default option
fr: Cochez pour définir l'option par défaut
sw: Chagua ili kufanya chaguo-msingi

source: Options
fr: Possibilités
sw: Chaguo

source: Basic
fr: Basique
sw: Msingi

source: Legend Type
fr: Type de légende
sw: Aina ya Hadithi

source: Can be a number or text e.g '10' or '10-20' or 'Vegetation'
fr: Il peut s'agir d'un nombre ou d'un texte, par exemple « 10 », « 10-20 » ou « Végétation ».
sw: Inaweza kuwa nambari au maandishi k.m '10' au '10-20' au 'Vegetation'

source: color
fr: couleur
sw: rangi

source: Color value e.g rgb(73,73,73) or #494949
fr: Valeur de couleur, par exemple RVB (73,73,73) ou #494949
sw: Thamani ya rangi k.m rgb(73,73,73) au #494949

source: Legend Items
fr: Objets de légende
sw: Vipengee vya Legend

source: Icon Image
fr: Image d'icône
sw: Picha ya ikoni

source: Icon Label
fr: Étiquette d'icône
sw: Lebo ya ikoni

source: Icon color
fr: Couleur de l'icône
sw: Rangi ya ikoni

source: Legend Icons
fr: Icônes de légende
sw: Aikoni za Hadithi

source: circle radius
fr: rayon du cercle
sw: radius ya mduara

source: Line Chart
fr: Graphique en ligne
sw: Chati ya mstari

source: Bar Chart
fr: Diagramme à bandes
sw: Chati ya Baa

source: Show data for point
fr: Afficher les données du point
sw: Onyesha data kwa uhakika

source: Show timeseries data for point
fr: Afficher les données de séries temporelles pour le point
sw: Onyesha data ya mfululizo wa nyakati kwa uhakika

source: Data unit
fr: Unité de données
sw: Kizio cha data

source: Chart Type
fr: Type de graphique
sw: Aina ya Chati

source: Chart Line/Bar Color
fr: Couleur des lignes/barres du graphique
sw: Mstari wa Chati/Rangi ya Upau

source: Mean of pixel values
fr: Moyenne des valeurs de pixels
sw: Wastani wa thamani za pixel

source: Sum of pixel values
fr: Somme des valeurs de pixels
sw: Jumla ya thamani za pixel

source: Minimum, Maximum pixel values
fr: Valeurs de pixels minimales et maximales
sw: Kiwango cha chini, cha juu zaidi cha thamani za pikseli

source: Minimum, Mean, Maximum pixel values
fr: Valeurs de pixels minimales, moyennes et maximales
sw: Kiwango cha chini, wastani, thamani za juu zaidi za pikseli

source: By Mean
fr: Par moyenne
sw: Kwa Maana

source: By Sum
fr: Par somme
sw: Kwa Jumla

source: Show data for area
fr: Afficher les données pour la zone
sw: Onyesha data ya eneo

source: Area value type
fr: Type de valeur de zone
sw: Aina ya data ya eneo

source: The value type that should be displayed
fr: Le type de valeur qui doit être affiché
sw: Aina ya data ambayo inapaswa kuonyeshwa

source: Show timeseries data for area
fr: Afficher les données de séries temporelles pour la zone
sw: Onyesha data ya mfululizo wa nyakati kwa eneo

source: Area timeseries data aggregation Method
fr: Méthode d'agrégation de données de séries temporelles de zone
sw: Mbinu ya ujumlishaji wa data ya mfululizo wa saa za eneo

source: How should the region data be aggregated ?
fr: Comment les données régionales doivent-elles être agrégées ?
sw: Je, data ya eneo inapaswa kujumlishwa vipi?

source: circle stroke color
fr: couleur du trait du cercle
sw: rangi ya kiharusi cha mduara

source: Link text
fr: Texte du lien
sw: Maandishi ya kiungo

source: Link Url
fr: URL du lien
sw: Anuani ya mtandao

source: Short description text
fr: Texte de brève description
sw: Maandishi ya maelezo mafupi

source: Format link as action button
fr: Formater le lien en tant que bouton d'action
sw: Fomati kiungo kama kitufe cha kitendo

source: Show arrow in button
fr: Afficher la flèche dans le bouton
sw: Onyesha kitufe cha kishale

source: layer
fr: couche
sw: safu

source: time
fr: temps
sw: wakati

source: Time for the raster file. This can be the time the data was acquired, or the date and time for which the data applies
fr: Il est temps pour le fichier raster. Il peut s'agir de l'heure à laquelle les données ont été acquises, ou de la date et de l'heure auxquelles les données s'appliquent.
sw: Wakati wa faili ya raster. Huu unaweza kuwa wakati ambao data ilipatikana, au tarehe na wakati ambao data hiyo inatumika

source: NetCDF Dates
fr: Dates NetCDF
sw: Tarehe katika faili ya NetCDF

source: Timestamps in the dataset
fr: Horodatages dans l'ensemble de données
sw: Nyakati zilizopo katika data

source: Time is required for every uploaded vector file. This can be the time the dataset was collected, or applies to.
fr: Du temps est requis pour chaque fichier vectoriel téléchargé. Il peut s'agir de l'heure à laquelle l'ensemble de données a été collecté ou à laquelle s'applique.
sw: Muda unahitajika kwa kila faili ya vekta iliyopakiwa. Huu unaweza kuwa wakati ambapo data ilikusanywa, au inatumika.

source: database table name
fr: nom de la table de base de données
sw: jina la jedwali la hifadhidata

source: dataset description
fr: description de l'ensemble de données
sw: maelezo ya data

source: optional dataset description
fr: description facultative de l'ensemble de données
sw: maelezo ya hiari ya data

source: GADM Country Geopackage
fr: Géopackage pays GADM
sw: GADM Geopackage ya Nchi

source: The uploaded file should be a geopackage, downloaded from https://gadm.org/download_country.html
fr: Le fichier téléchargé doit être un géopackage, téléchargé depuis https://gadm.org/download_country.html
sw: Faili iliyopakiwa inapaswa kuwa geopackage, iliyopakuliwa kutoka https://gadm.org/download_country.html

source: Maximum value should be greater than minimum value
fr: La valeur maximale doit être supérieure à la valeur minimale
sw: Thamani ya juu inapaswa kuwa kubwa kuliko thamani ya chini zaidi

source: Minimum value should be less than maximum value
fr: La valeur minimale doit être inférieure à la valeur maximale
sw: Thamani ya chini inapaswa kuwa chini ya thamani ya juu zaidi

source: Steps required when not using custom colors
fr: Étapes requises lorsque vous n'utilisez pas de couleurs personnalisées
sw: Hatua zinazohitajika wakati hutumii rangi maalum

source: Color for the rest of values must be specified
fr: La couleur du reste des valeurs doit être spécifiée
sw: Rangi kwa thamani zingine lazima ibainishwe

source: You selected to use custom colors but did not add any. Please add color values and save.
fr: Vous avez choisi d'utiliser des couleurs personnalisées, mais vous n'en avez ajouté aucune. Veuillez ajouter des valeurs de couleur et enregistrer.
sw: Ulichagua kutumia rangi maalum lakini hukuongeza zozote. Tafadhali ongeza thamani za rangi na uhifadhi.

source: Value must be greater than minimum defined value
fr: La valeur doit être supérieure à la valeur minimale définie
sw: Thamani lazima iwe kubwa kuliko kima cha chini kilichobainishwa

source: Value must be less than or equal to the maximum defined value
fr: La valeur doit être inférieure ou égale à la valeur maximale définie
sw: Thamani lazima iwe chini ya au sawa na kiwango cha juu kilichobainishwa

source: Stations Shapefile ZIP
fr: Fichier de forme des stations ZIP
sw: Faili ya Stations ikiwa kwa muundo wa Zipped Shapefile

source: Station name field
fr: Champ Nom de la station
sw: Sehemu ya jina la kituo

source: Create Dataset
fr: Créer un ensemble de données
sw: Unda DataSeti

source: Add Layer
fr: Ajouter un calque
sw: Ongeza Tabaka

source: Add %(object)s Layer
fr: Ajouter %(object)s un calque
sw: Ongeza Tabaka kwa %(object)s

source: User
fr: Utilisateur
sw: Mtumiaji

source: Name
fr: Nom
sw: Jina

source: Geostore Id
fr: Identifiant du géostore
sw: Kitambulisho cha Geostore

source: Public
fr: Publique
sw: Ya Umma

source: Type
fr: Taper
sw: Aina

source: Products
fr: Des produits
sw: Bidhaa

source: Tags
fr: Mots clés
sw: Lebo

source: Webhook Url
fr: URL du webhook
sw: Url ya Mtandao ya Webhook

source: Area of Interest
fr: Lieu d'intérêt
sw: Eneo la Kuvutia

source: Areas of Interest
fr: Centres d'intérêt
sw: Maeneo ya Kuvutia

source: title
fr: titre
sw: kichwa

source: Title of the category
fr: Titre de la catégorie
sw: Kichwa cha kategoria

source: icon
fr: icône
sw: ikoni

source: active
fr: actif
sw: inatumika

source: Is the category active ?
fr: La catégorie est-elle active ?
sw: Je, kitengo kinatumika?

source: public
fr: publique
sw: umma

source: Is the category public ?
fr: La catégorie est-elle publique ?
sw: Je, kitengo ni cha umma?

source: Category
fr: Catégorie
sw: Kategoria

source: Categories
fr: Catégories
sw: Kategoria

source: Sub Categories
fr: Sous-catégories
sw: Vitengo Ndogo

source: Sub Category
fr: Sous-catégorie
sw: Kitengo Ndogo

source: Subcategory
fr: Sous-catégorie
sw: Kitengondogo

source: Subcategories
fr: Sous-catégories
sw: Vitengo vidogo

source: Raster File - NetCDF/GeoTiff
fr: Fichier raster - NetCDF/GeoTiff
sw: Faili ya Raster - NetCDF/GeoTiff

source: Vector File - Shapefile, Geojson
fr: Fichier vectoriel - Shapefile, Geojson
sw: Faili ya Vector - Shapefile, Geojson

source: Latest From Source
fr: Dernière source
sw: Muda ulio wa karibu kama ilivyo kwenye data

source: Previous to now
fr: Avant maintenant
sw: Mudal uliotangulia ikilinganishwa na hivi sasa

source: Next to Now
fr: À côté de maintenant
sw: Muda ulio Karibia na Sasa

source: The Dataset title as will appear to the public
fr: Le titre de l'ensemble de données tel qu'il apparaîtra au public
sw: Kichwa cha Data kama itakavyoonekana kwa umma

source: category
fr: catégorie
sw: kategoria

source: summary
fr: résumé
sw: muhtasari

source: Short summary of less than 100 characters
fr: Bref résumé de moins de 100 caractères
sw: Muhtasari mfupi wa chini ya herufi 100

source: Layer type
fr: Type de calque
sw: Aina ya safu

source: published
fr: publié
sw: imechapishwa na inaweza onekana

source: Should the dataset be available for visualization ? If unchecked, the dataset is assumed to be in draft mode and thus not ready
fr: L’ensemble de données doit-il être disponible pour la visualisation ? Si cette case n'est pas cochée, l'ensemble de données est supposé être en mode brouillon et donc pas prêt.
sw: Je! data hii inapaswa kupatikana kwa taswira? Ikiwa haijachaguliwa, seti ya data inadhaniwa kuwa katika hali ya rasimu na hivyo haiko tayari

source: Should the dataset be visible to everyone ? If unchecked, only authorized users can view
fr: L’ensemble de données doit-il être visible par tout le monde ? Si cette case n'est pas cochée, seuls les utilisateurs autorisés peuvent voir
sw: Je, mkusanyiko wa data unapaswa kuonekana kwa kila mtu? Ikiwa haijachaguliwa, ni watumiaji walioidhinishwa pekee wanaoweza kutazama

source: Initially visible on Map by default
fr: Initialement visible sur la carte par défaut
sw: Hapo awali, ilionekana kwenye Ramani kwa chaguomsingi

source: Make the dataset visible on the map by default
fr: Rendre l'ensemble de données visible sur la carte par défaut
sw: Fanya data ionekane kwenye ramani kwa chaguomsingi

source: Multi-temporal
fr: Multi-temporel
sw: Ina data ya muda mwingi

source: The dataset is multi-temporal
fr: L'ensemble de données est multitemporel
sw: Seti ya data ni ya muda mwingi

source: Multi-layer
fr: Multicouche
sw: Ina Safu nyingi

source: The dataset has more than one layer, to be displayed together
fr: L'ensemble de données comporte plusieurs couches, à afficher ensemble
sw: Seti ya data ina safu zaidi ya moja, ya kuonyeshwa pamoja

source: Near realtime
fr: En temps quasi réel
sw: Karibu na wakati halisi

source: Is the layer near realtime?, for example updates every 10 minutes
fr: La couche est-elle quasiment en temps réel ?, par exemple, mise à jour toutes les 10 minutes
sw: Je, safu iko karibu na wakati halisi?, kwa mfano husasishwa kila baada ya dakika 10

source: current time method
fr: méthode de l'heure actuelle
sw: njia ya wakati wa sasa

source: How to pick default time and for updates, for Multi-Temporal data
fr: Comment choisir l'heure par défaut et pour les mises à jour, pour les données multitemporelles
sw: Jinsi ya kuchagua muda chaguo-msingi na masasisho, kwa data ya Muda mwingi

source: Auto Update interval in minutes
fr: Intervalle de mise à jour automatique en minutes
sw: Muda wa Usasishaji Kiotomatiki kwa dakika

source: After how many minutes should the layer auto update on the map to show current data, if multi-temporal. Leave empty to disable auto updating
fr: Après combien de minutes la couche doit-elle se mettre à jour automatiquement sur la carte pour afficher les données actuelles, si elles sont multitemporelles. Laissez vide pour désactiver la mise à jour automatique
sw: Baada ya dakika ngapi safu inapaswa kusasishwa kiotomatiki kwenye ramani ili kuonyesha data ya sasa, ikiwa ni ya muda mwingi. Acha tupu ili kuzima usasishaji kiotomatiki

source: Enable Clipping by shape
fr: Activer le découpage par forme
sw: Washa Kupunguza kwa umbo

source: Check to enable clipping by boundary or drawn shapes, for raster and vector datasets. Not implemented for WMS types
fr: Cochez pour activer le découpage par limite ou par formes dessinées, pour les jeux de données raster et vectorielles. Non implémenté pour les types WMS
sw: Angalia ili kuwezesha kukatwa kwa mpaka au maumbo yaliyochorwa, kwa data za raster na vekta. Haijatekelezwa kwa aina za WMS

source: Dataset
fr: Base de données
sw: Dataseti

source: Datasets
fr: Ensembles de données
sw: Seti za data

source: Title of the dataset
fr: Titre de l'ensemble de données
sw: Kichwa cha seti ya data

source: subtitle
fr: Sous-titre
sw: manukuu

source: Subtitle if any
fr: Sous-titre s'il y en a
sw: Manukuu kama yapo

source: Dataset summary
fr: Résumé de l'ensemble de données
sw: Muhtasari wa seti ya data

source: Short summary of what the dataset shows. Keep it short.
fr: Bref résumé de ce que montre l’ensemble de données. Soyez bref.
sw: Muhtasari mfupi wa kile ambacho mkusanyiko wa data unaonyesha. Iwe fupi.

source: resolution
fr: résolution
sw: azimio

source: The Spatial resolution of the dataset, for example 10km by 10 km
fr: La résolution spatiale de l'ensemble de données, par exemple 10 km sur 10 km
sw: Azimio la anga la seti ya data, kwa mfano 10km kwa 10 km

source: Geographic coverage
fr: Couverture géographique
sw: Chanjo ya kijiografia

source: The geographic coverage of the dataset. For example East Africa or specific country name like Ethiopia, or Africa
fr: La couverture géographique de l'ensemble de données. Par exemple, l'Afrique de l'Est ou un nom de pays spécifique comme l'Éthiopie ou l'Afrique.
sw: Ufunikaji wa kijiografia wa mkusanyiko wa data. Kwa mfano Afrika Mashariki au jina maalum la nchi kama Ethiopia, au Afrika

source: source
sw: chanzo

source: The source of the data where was it generated or produced
fr: La source des données où ont-elles été générées ou produites
sw: Chanzo cha data ambapo ilitolewa au kuzalishwa

source: license
fr: Licence
sw: leseni

source: Any licensing information for the dataset
fr: Toute information de licence pour l'ensemble de données
sw: Maelezo yoyote ya leseni ya mkusanyiko wa data

source: Frequency of updates
fr: Fréquence des mises à jour
sw: Masasisho ya mara kwa mara

source: How frequent is the dataset updated. For example daily, weekly, monthly etc
fr: À quelle fréquence l'ensemble de données est-il mis à jour. Par exemple quotidiennement, hebdomadairement, mensuellement, etc.
sw: Seti ya data inasasishwa mara ngapi. Kwa mfano kila siku, wiki, mwezi n.k

source: detail
fr: détail
sw: undani

source: Detail description of the dataset, including the methodology, references or any other relevant information
fr: Description détaillée de l'ensemble de données, y compris la méthodologie, les références ou toute autre information pertinente
sw: Maelezo ya kina ya seti ya data, ikijumuisha mbinu, marejeleo au taarifa nyingine yoyote muhimu

source: cautions
fr: mises en garde
sw: tahadhari

source: What things should users be aware as they use and interpret this dataset
fr: À quoi les utilisateurs doivent-ils être conscients lorsqu'ils utilisent et interprètent cet ensemble de données ?
sw: Ni mambo gani watumiaji wanapaswa kufahamu wanapotumia na kutafsiri mkusanyiko huu wa data

source: citation
sw: nukuu

source: Scientific citation for this dataset if any. For example the citation for a scientific paper for the dataset
fr: Citation scientifique pour cet ensemble de données, le cas échéant. Par exemple la citation d'un article scientifique pour l'ensemble de données
sw: Nukuu ya kisayansi ya mkusanyiko huu wa data ikiwa ipo. Kwa mfano manukuu ya karatasi ya kisayansi ya seti ya data

source: Data download link
fr: Lien de téléchargement des données
sw: Kiungo cha kupakua data

source: External link to where the source data can be found and downloaded
fr: Lien externe vers l'endroit où les données sources peuvent être trouvées et téléchargées
sw: Kiungo cha nje ambapo data chanzo inaweza kupatikana na kupakuliwa

source: Learn more link
fr: Lien pour en savoir plus
sw: Jifunze kiungo zaidi

source: External link to where more detail about the dataset can be found
fr: Lien externe vers où plus de détails sur l'ensemble de données peuvent être trouvés
sw: Kiungo cha nje ambapo maelezo zaidi kuhusu seti ya data yanaweza kupatikana

source: Layer title
fr: Titre du calque
sw: Kichwa cha safu

source: Is Default Layer
fr: Est le calque par défaut
sw: Ni Tabaka Chaguomsingi

source: Maximum upload size in MegaBytes
fr: Taille maximale de téléchargement en mégaoctets
sw: Upeo wa ukubwa wa upakiaji katika MegaBytes

source: Maximum raster file size that can be uploaded in MegaBytes. Default is 10Mbs.
fr: Taille maximale du fichier raster pouvant être téléchargé en mégaoctets. La valeur par défaut est 10 Mo.
sw: Upeo wa ukubwa wa faili mbaya ambao unaweza kupakiwa katika MegaBytes. Chaguomsingi ni 10Mbs.

source: Crop raster to country
fr: Recadrer le raster vers le pays
sw: Panda raster kwa nchi

source: Crop the uploaded raster file to the country boundaries
fr: Recadrez le fichier raster téléchargé selon les limites du pays
sw: Punguza faili ya raster iliyopakiwa hadi kwenye mipaka ya nchi

source: cap base url
fr: URL de base du capuchon
sw: url ya msingi wa kofia

source: cap layer sub category
fr: sous-catégorie de couche de finition
sw: kategoria ndogo ya safu ya kofia

source: Auto Refresh interval in minutes
fr: Intervalle de rafraîchissement automatique en minutes
sw: Muda wa Kuonyesha Kiotomatiki kwa dakika

source: Refresh cap alerts on the map after this minutes. Leave blank to disable auto refreshing
fr: Actualisez les alertes de plafond sur la carte après ces minutes. Laisser vide pour désactiver l'actualisation automatique
sw: Onyesha upya arifa za upeo kwenye ramani baada ya dakika hizi. Acha wazi ili kuzima uonyeshaji upya kiotomatiki

source: CAP layer shown by default
fr: Couche CAP affichée par défaut
sw: Safu ya CAP iliyoonyeshwa kwa chaguo-msingi

source: CAP Layer shown on map by default
fr: Couche CAP affichée sur la carte par défaut
sw: Safu ya CAP inayoonyeshwa kwenye ramani kwa chaguo-msingi

source: GADM Boundary Data Version
fr: Version des données des limites du GADM
sw: Toleo la Data ya Mpaka wa GADM

source: It is encouraged to use the latest version. See available versions here: https://gadm.org/old_versions.html
fr: Il est encouragé à utiliser la dernière version. Voir les versions disponibles ici : https://gadm.org/old_versions.html
sw: Inahimizwa kutumia toleo la hivi karibuni. Tazama matoleo yanayopatikana hapa: https://gadm.org/old_versions.html

source: GL Styles Font Url
fr: URL de la police des styles GL
sw: Url ya Fonti ya Mitindo ya GL

source: Open Map Tiles Source
fr: Ouvrir la source des tuiles de carte
sw: Fungua Chanzo cha Vigae kwenye Ramani

source: Logo
sw: Nembo

source: Logo page
fr: Page de logos
sw: Ukurasa wa nembo

source: Internal page to navigate to on clicking the logo
fr: Page interne vers laquelle accéder en cliquant sur le logo
sw: Ukurasa wa ndani wa kuelekea kwa kubofya nembo

source: Logo external link
fr: Lien externe du logo
sw: Nembo kiungo cha nje

source: Used if internal logo page not provided
fr: Utilisé si la page de logo interne n'est pas fournie
sw: Inatumika ikiwa ukurasa wa nembo ya ndani haujatolewa

source: Terms of Service Page
fr: Page Conditions d'utilisation
sw: Ukurasa wa Masharti ya Huduma

source: MapViewer Terms of Service page
fr: Page Conditions d'utilisation de MapViewer
sw: Ukurasa wa Sheria na Masharti ya MapViewer

source: Privacy Policy Page
fr: Page Politique de confidentialité
sw: Ukurasa wa Sera ya Faragha

source: MapViewer Privacy Policy Page
fr: Page Politique de confidentialité de MapViewer
sw: Ukurasa wa Sera ya Faragha ya Kitazamaji cha Ramani

source: background color
fr: Couleur de l'arrière plan
sw: rangi ya mandharinyuma

source: image
sw: picha

source: basemap group
fr: groupe de fond de carte
sw: kikundi cha msingi

source: labels group
fr: groupe d'étiquettes
sw: kikundi cha lebo

source: Is default style ?
fr: Le style est-il par défaut ?
sw: Je, ni mtindo chaguo-msingi?

source: Geomanager Settings
fr: Paramètres du géogestionnaire
sw: Mipangilio ya Geomanager

source: Upload Settings
fr: Paramètres de téléchargement
sw: Pakia Mipangilio

source: Basemap TileServer Settings
fr: Paramètres du serveur de tuiles de fond de carte
sw: Mipangilio ya TileServer ya Basemap

source: CAP Layer Settings
fr: Paramètres de la couche CAP
sw: Mipangilio ya Tabaka la CAP

source: Navigation Settings
fr: Paramètres de navigation
sw: Mipangilio ya Urambazaji

source: Gender
fr: Genre
sw: Jinsia

source: Country
fr: Pays
sw: Nchi

source: City
fr: Ville
sw: Jiji

source: Sector
fr: Secteur
sw: Sekta

source: Organization
fr: Organisation
sw: Shirika

source: Organization Type
fr: Type d'Organisation
sw: Aina ya Shirika

source: Scale of Operations
fr: Échelle des opérations
sw: Kiwango cha Uendeshaji

source: Position
sw: Nafasi

source: How do you Use
fr: Comment utilisez-vous
sw: Unatumiaje

source: Interests
fr: Intérêts
sw: Maslahi

source: GeoManager User Profile
fr: Profil utilisateur GeoManager
sw: Profaili ya Mtumiaji ya GeoManager

source: GeoManager User Profiles
fr: Profils utilisateur GeoManager
sw: Profaili za Mtumiaji wa GeoManager

source: dataset
fr: base de données
sw: seti ya data

source: style
sw: mtindo

source: Point Analysis
fr: Analyse des points
sw: Uchambuzi wa Pointi

source: Area Analysis
fr: Analyse de zone
sw: Uchambuzi wa Eneo

source: Analysis
fr: Analyse
sw: Uchambuzi

source: Raster File Layer
fr: Couche de fichiers raster
sw: Safu ya Faili ya Raster

source: Raster File Layers
fr: Couches de fichiers raster
sw: Tabaka za Faili za Raster

source: Create Style
fr: Créer un style
sw: Unda Mtindo

source: Edit Style
fr: Modifier le style
sw: Hariri Mtindo
