Repository: pypi-data/pypi-mirror-381
Catalog: packages/geomanager/geomanager-0.5.8.tar.gz/geomanager-0.5.8/geomanager/locale/*/LC_MESSAGES/django.po
Languages: fr, sw

source: Create from datasets
fr: Créer à partir d'ensembles de données
sw: Unda kutoka kwa hifadhidata

source: File Layers
fr: Calques de fichiers
sw: Tabaka za Faili

source: Uploaded Files
fr: Fichiers téléchargés
sw: Faili Zilizopakiwa

source: Preview on Map
fr: Aperçu sur la carte
sw: Hakiki kwenye Ramani

source: View Uploaded Files
fr: Afficher les fichiers téléchargés
sw: Tazama Faili Zilizopakiwa

source: Preview Layer
fr: Aperçu du calque
sw: Safu ya Hakiki

source: Color Preview
fr: Aperçu des couleurs
sw: Onyesho la Kuchungulia Rangi

source: Vector Layers
fr: Couches vectorielles
sw: Tabaka za Vector

source: Boundary Settings
fr: Paramètres de limite
sw: Mipangilio ya Mipaka

source: Boundary Data
fr: Données de limite
sw: Data ya mipaka

source: Settings
fr: Paramètres
sw: Mipangilio

source: Gradient
fr: Pente

source: Choropleth
fr: Choroplèthe

source: Web Map Service - WMS Layer
fr: Service de carte Web - Couche WMS

source: XYZ Raster Tile Layer
fr: Couche de tuiles raster XYZ

source: XYZ Vector Tile Layer
fr: Couche de tuiles vectorielles XYZ

source: interpolate
fr: interpoler
