Repository: pypi-data/pypi-mirror-381
Catalog: packages/plonegovbr.socialmedia/plonegovbr_socialmedia-2.0.0a10-py3-none-any.whl/plonegovbr/socialmedia/locales/*/LC_MESSAGES/plonegovbr.socialmedia.po
Languages: eu, pt_br

source: Add social media links to a content.
eu: Gehitu sare sozialen estekak elementu-mota bati.
pt_br: Adiciona links de redes sociais a um conteúdo.

source: Configure social media settings for a content.
eu: Konfiguratu sare sozialen ezarpenak elementu-mota bati.
pt_br: Configurações de redes sociais para um conteúdo

source: Create example content to showcase the new add-on
eu: Adibide-edukia sortu
pt_br: Criação de conteúdo de exemplo para demonstrar o novo complemento

source: Facebook username
eu: Facebook erabiltzaile-izena
pt_br: Nome de usuário do Facebook

source: Include meta tags on pages to give hints to social media on how to better render your pages when shared
eu: Sare sozialetan zure edukia txukun agertzeko meta etiketak gehitu
pt_br: Inclui meta tags nas páginas para otimizar como elas são exibidas em outros sites

source: Package to configure a new Social Media support for Plone site
eu: Plone atari baten sare sozialen konfigurazioa gehitzeko paketea
pt_br: Configuração de suporte a mídias sociais para um site Plone

source: Profiles
eu: Profilak
pt_br: Perfis

source: Share social data
eu: Partekatu datu sozialak
pt_br: Compartilhar metadados

source: Social Media
eu: Sare sozialak
pt_br: Mídias sociais

source: Social Media support for Plone: Demo content
eu: Sare sozialen konfigurazioa Plonen: adibideko edukia
pt_br: Suporte a mídias sociais para Plone: Conteúdo de exemplo

source: Social Media support for Plone: Install
eu: Sare sozialen konfigurazioa Plonen: instalatu
pt_br: Suporte a mídias sociais para Plone

source: Social Media support for Plone: Uninstall
eu: Sare sozialen konfigurazioa Plonen: desinstalatu
pt_br: Suporte a mídias sociais para Plone: Remover

source: Social Media: Links
eu: Sare sozialak: estekak
pt_br: Mídias sociais: Links

source: Social Media: Settings
eu: Sare sozialak: ezarpenak
pt_br: Mídias sociais: Configurações

source: To be used with some integrations like Open Graph data
eu: Open Graph datuekin erabiltzeko
pt_br: Para ser utilizado em integrações como Open Graph

source: Uninstall Social Media support for Plone setup.
eu: Desintalatu Sare Sozialen ezarpenak.
pt_br: Desinstala o suporte a mídias sociais para Plone

source: X username
eu: X webguneko erabiltzaile-izena
pt_br: Nome de usuário no X
