Repository: pypi-data/pypi-mirror-381
Catalog: packages/*-flickrgallery/*_flickrgallery-1.1.0-py3-none-any.whl/*_flickrgallery/locales/*/LC_MESSAGES/*_flickrgallery.po
Languages: eu

source: Flickr API key
eu: Flickr APIaren gakoa

source: Flickr API secret
eu: Flickr APIaren sekretua

source: Flickr Settings
eu: Flickr ezarpenak

source: Flickr User ID
eu: Flicrk erabiltzailearen ida

source: Flickr collection id
eu: Flickr bildumaren ida

source: Flickr configuration
eu: Flickr ezarpenak

source: Flickr set id
eu: Flickr setaren ida

source: Force update
eu: Eguneratu

source: Package to configure a new cs_flickrgallery site
eu: cs_flickrgalleryren konfigurazio

source: Photos imported from Flickr
eu: Argazkiak ongi inportatu dira Flickretik

source: Uninstall cs_flickrgallery setup.
eu: Kendu cs_flickrgallery-ren konfigurazioa

source: You have ${photos} photos from Flickr
eu: Flickreko ${photos} argazki dituzu
