Repository: pypi-data/pypi-mirror-381
Catalog: packages/*-flickrgallery/*_flickrgallery-1.1.0.tar.gz/*_flickrgallery-1.1.0/src/*_flickrgallery/locales/*/LC_MESSAGES/*_flickrgallery.po
Languages: es

source: Flickr API key
es: Clave de API de Flickr

source: Flickr API secret
es: Secreto de API de Flickr

source: Flickr Settings
es: Configuración de Flickr

source: Flickr User ID
es: ID de usuario de Flickr

source: Flickr collection id
es: ID de colección de Flickr

source: Flickr configuration
es: Configuración de Flickr

source: Flickr set id
es: ID del set de Flickr

source: Force update
es: Forzar actualización

source: Package to configure a new cs_flickrgallery site
es: Instalación de la configuración de cs_flickrgallery

source: Photos imported from Flickr
es: Fotos inportadas de Flickr

source: Uninstall cs_flickrgallery setup.
es: Desinstalar configuración de Flickr

source: You have ${photos} photos from Flickr
es: Tienes ${photos} de Flickr
