from exoheat import Walls
from exoheat.LocalisationData import Localisation
from exoheat.Walls import ThermalResistance
from exoheat.Walls import WallLosses
from exoheat.Walls import FloorLosses
from exoheat.Walls import WallInfiltration
from exoheat.Walls import f_zon
from exoheat.Walls import wall_wind_direct
from exoheat.Walls import HeatDissipation
from exoheat.Walls import WaterSupply
from exoheat.Flask4LaTex import SAPR


"""Программный модуль предназначен для решения задач расчета тепловых потерь
через ограждающие конструкции зданий, домов и сооружений.

Программный модуль ExoHeat разработан для учебного курса
"Автоматизация инженерных расчетов" читаемый на кафедре:
Промышленных теплоэнергетических систем(ПТС) 
Курзановым С.Ю.
Организация:  Федеральное государственное бюджетное образовательное учреждение
высшего образования "Национальный исследовательский университет "МЭИ"

Данный программный модуль необходим для расчета тепловых потерь через
ограждающие конструкции зданий, домов и сооружений.

Состоит из группы классов:
 - ThermalResistance - для расчета температуры наружного воздуха, тепловой 
 инерционности, сопротивления теплопередаче через наружные ограждения здания;
 - WallLosses - для расчета количества теряемой тепловой энергии за счет 
 теплопроводности через боковые, напольные, потолочные ограждения;
 - FloorLosses - для расчета количества теряемой тепловой энергии за счет 
 теплопроводности через напольные ограждения(перекрытия) на основе деления 
 ограждения(перекрытия) на площадные зоны;
 - WallInfiltration - для расчета количества теряемой тепловой энергии за счет 
 инфильтрации через поверхности, щели, проемы боковых ограждений;
 - HeatDissipation - для расчета тепловыделений от людей и электрических 
 приборов;
 - WaterSupply - для расчета максимальной тепловой нагрузки на горячее 
 водоснабжение зданий в отопительный и летний периоды.

Все классы необходимые для расчета количества теряемой тепловой энергии 
рассчитывают значения в номинальном режиме эксплуатации здания или сооружения. 
При необходимости дополнительно можно в них задать температуру внутри и 
снаружи, а для расчета инфильтрации дополнительно можно задать направление 
ветра и скорость.

Все классы обслуживаются классом Localisation приведенным в качестве примера и 
содержит группу параметров на основе значений которых происходят расчеты во 
всех классах данного модуля. Для задания уникальных параметров собственного 
проекта необходимо либо отредактировать исходный класс, либо создать его копию 
для заполнения значений необходимых параметров, имеющих отношения к локализации 
и климатическим условиям.

Все классы необходимые для расчета количества теряемой тепловой энергии так же 
требуют для задания материалов, пример задания материалов содержится в файле 
Matherials.

В классах WallLosses и FloorLosses есть возможность посчитать общую стоимость 
материалов ограждающих конструкций зданий, домов и сооружений, для ее работы 
необходимо задать в классах ThermalResistance (пример есть в Matherials) 
удельную стоимость, отнесенную на единицу объема, каждого материала из 
которого состоит ограждающая конструкция. Для оконных рам со стеклопакетами 
можно условно задаться удельной стоимостью одного слоя пересчитанной на 
стоимость всего стеклопакета.

Класс SAPR позволяет запустить локальных сервер с выводом всего расчета в 
виде HTML страницы с подставленными формулами и значениями.

Site: www.mpei.ru
E-mail: srg100@list.ru
"""

