from LocalisationData import Localisation
from exoheat import ThermalResistance, WallLosses, f_zon, FloorLosses, WallInfiltration


##print("---- Работает модуль BuildingsTypes ---")


loc = Localisation()


#Пирог стены δ_1 = 0.02, λ_1 = 50, δ_2 = 0.25, λ_2 = 200
r_concrete = ThermalResistance("Железобетон, Раствор цементно-песчаный", loc,
                               [0.25,        0.02],  #δ_m, м
                               [1.69,        0.93],  #λ_m, Вт * м⁻¹ * ℃⁻¹
                               [0.84,        0.84],  #c_m, кДж * кг⁻¹ * ℃⁻¹
                               [2500,        1800],  #ρ_m, кг * м⁻³
                               внутри = "стена", снаружи = "поверхность_соприкасающаяся_непосредственно_с_наружным_воздухом")
#!!! Рассмотреть категории эксплуатации А и Б
r_srub_kirpich = ThermalResistance("Деревянный сруб, Кирпич", loc,# https://docs.cntd.ru/document/1200095525/titles/8QG0M7
                               [0.25,            0.065], #δ_m, м
                               [0.09,            0.93],  #λ_m, Вт * м⁻¹ * ℃⁻¹
                               [2.3,             0.88],  #c_m, кДж * кг⁻¹ * ℃⁻¹
                               [500,             1800],  #ρ_m, кг * м⁻³
                               внутри = "стена", снаружи = "поверхность_соприкасающаяся_непосредственно_с_наружным_воздухом")

r_dver_derevo = ThermalResistance("Деревянная", loc,# https://docs.cntd.ru/document/1200095525/titles/8QG0M7
                               [0.12,],  #δ_m, м
                               [0.09,],  #λ_m, Вт * м⁻¹ * ℃⁻¹
                               [2.3,],   #c_m, кДж * кг⁻¹ * ℃⁻¹
                               [500,],   #ρ_m, кг * м⁻³
                               внутри = "стена", снаружи = "поверхность_соприкасающаяся_непосредственно_с_наружным_воздухом")

r_pbet_mvata = ThermalResistance("Пескобетон, Мин.вата", loc,# https://docs.cntd.ru/document/1200095525/titles/8QG0M7
                               [0.3,             0.065], #δ_m, м
                               [0.32,            0.038], #λ_m, Вт * м⁻¹ * ℃⁻¹
                               [0.84,            0.84],  #c_m, кДж * кг⁻¹ * ℃⁻¹
                               [1000,            180],   #ρ_m, кг * м⁻³
                               внутри = "стена", снаружи = "поверхность_соприкасающаяся_непосредственно_с_наружным_воздухом")

r_2steklo = ThermalResistance("Двойной стеклопакет", loc,# https://www.stis.ru/help/products/soprotivlenie-teploperedache-steklopaketa/
                               [0.032,           ], #δ_m, м
                               [0.032/0.52,      ], #λ_m, Вт * м⁻¹ * ℃⁻¹
                               [0.84,            ], #c_m, кДж * кг⁻¹ * ℃⁻¹ #!!! А это же для стекла, а не для стеклопакета
                               [2500,            ], #ρ_m, кг * м⁻³ #!!! А это же для стекла, а не для стеклопакета
                               внутри = "окно", снаружи = "поверхность_соприкасающаяся_непосредственно_с_наружным_воздухом")

r_float_st1 = ThermalResistance("Флоат-стекло 1", loc,# https://www.oknatrade.ru/help/float-steklo-termopolirovannoe-steklo/
                               [0.01,            ], #δ_m, м
                               [1,               ], #λ_m, Вт * м⁻¹ * ℃⁻¹
                               [0.8,             ], #c_m, кДж * кг⁻¹ * ℃⁻¹ #!!! А это же для стекла, а не для стеклопакета
                               [2350,            ], #ρ_m, кг * м⁻³ #!!! А это же для стекла, а не для стеклопакета
                               внутри = "окно", снаружи = "поверхность_соприкасающаяся_непосредственно_с_наружным_воздухом")

r_float_st2 = ThermalResistance("Флоат-ст2 Стекло, Силикон, Стекло, Силикон, Стекло", loc,# для силиконов https://s.siteapi.org/f3460fa8c7140e3/docs/2330f4def1e368bb7655a0f12a383115ea330aa7.pdf
                                          [0.0032, 0.001,   0.0032, 0.001,   0.0032], #δ_m, м
                                          [0.76,   1   ,    0.76,   1   ,    0.76], #λ_m, Вт * м⁻¹ * ℃⁻¹
                                          [0.84,   0.84,    0.84,   0.84,    0.84], #c_m, кДж * кг⁻¹ * ℃⁻¹ #!!! А это же для стекла, а не для стеклопакета
                                          [2500,   1300,    2500,   1300,    2500], #ρ_m, кг * м⁻³ #!!! А это же для стекла, а не для стеклопакета
                                          [3541/1.3/0.575/0.032, 0, 0, 0, 0],  #ц_m, ₽ * м⁻³ - цена материала #https://www.okonsib.ru/zakazat-steklopaket-bez-ramy.html
                                          внутри = "окно", снаружи = "поверхность_соприкасающаяся_непосредственно_с_наружным_воздухом")

r_float_st3 = ThermalResistance("Флоат-ст2 Стекло, Силикон, Стекло, Воздух, Стекло, Силикон, Стекло", loc,# для силиконов https://s.siteapi.org/f3460fa8c7140e3/docs/2330f4def1e368bb7655a0f12a383115ea330aa7.pdf
                                          [0.0032, 0.001,   0.0032,   0.04, 0.0032, 0.001,   0.0032], #δ_m, м
                                          [0.76,   1   ,    0.76,   0.0084,   0.76,   1   ,    0.76], #λ_m, Вт * м⁻¹ * ℃⁻¹
                                          [0.84,   0.84,    0.84,    1.007,   0.84,   0.84,    0.84], #c_m, кДж * кг⁻¹ * ℃⁻¹ #!!! А это же для стекла, а не для стеклопакета
                                          [2500,   1300,    2500,   1.2754,   2500,   1300,    2500], #ρ_m, кг * м⁻³ #!!! А это же для стекла, а не для стеклопакета
                                          внутри = "окно", снаружи = "поверхность_соприкасающаяся_непосредственно_с_наружным_воздухом")

r_polycarbon10 = ThermalResistance("Поликарбонат 10", loc,# http://www.polikarbonat-info.ru/catalog/termicheskoe_soprotivlenie_teploperedache_polikarbonata_sot
                               [0.01,            ], #δ_m, м
                               [0.01 / 0.35,     ], #λ_m, Вт * м⁻¹ * ℃⁻¹
                               [1.1,             ], #c_m, кДж * кг⁻¹ * ℃⁻¹ #https://tehtab.ru/Guide/GuidePhysics/GuidePhysicsHeatAndTemperature/SpecificHeat/SpecificHeatPolimers/
                               [170,             ], #ρ_m, кг * м⁻³ # взято делением Веса [кг * м⁻²] на толщину 0.01м 
                               внутри = "окно", снаружи = "поверхность_соприкасающаяся_непосредственно_с_наружным_воздухом")

r_floor = ThermalResistance("Железобетон, Раствор цементно-песчаный", loc,
                               [0.25,        0.02],  #δ_m, м
                               [1.69,        0.93],  #λ_m, Вт * м⁻¹ * ℃⁻¹
                               [0.84,        0.84],  #c_m, кДж * кг⁻¹ * ℃⁻¹
                               [2500,        1800],  #ρ_m, кг * м⁻³
                               внутри = "пол", снаружи = "перекрытия_выходящие_в_неотапливаемый_подвал_без_световых_проемов")

r_floor_CARBON_ECO = ThermalResistance("Наливной пол, Железобетон, CARBON_ECO, Песчанная подушка, Грунт", loc,
                                       [0.05,         0.15,        0.15,      0.15,              3.0],  #δ_m, м
                                       [0.93,         1.69,        0.034,     0.814,             1.2],   #λ_m, Вт * м⁻¹ * ℃⁻¹
                                       [0.84,         0.84,        1.45,      0.835,             0.92],  #c_m, кДж * кг⁻¹ * ℃⁻¹
                                       [1800,         2500,          32,      1800,              1800],  #ρ_m, кг * м⁻³
                                       [3541/1.3/0.575/0.032, 0, 0, 0, 0],  #ц_m, ₽ * м⁻³ - цена материала #https://www.okonsib.ru/zakazat-steklopaket-bez-ramy.html
                                       внутри = "пол", снаружи = "перекрытие_уложенное_непосредственно_на_грунт")

r_conc_sht = ThermalResistance("ЖБ  , Штукатурка", loc,
                               [0.25, 0.02],#δ_m, м - толщина слоя
                               [1.69, 0.93],#λ_m, Вт * м⁻¹ * ℃⁻¹ - теплопроводность материала
                               [0.84, 0.84],#c_m, Дж * кг⁻¹ * ℃⁻¹ - теплоёмкость материала
                               [2500, 1800],#ρ_m, кг * м⁻³ - плотность материала
                               [4.4*2500, 4.1*1800],#ц_m, ₽ * м⁻³ - цена материала
                               внутри='стена',
                               снаружи='поверхность_соприкасающаяся_непосредственно_с_наружным_воздухом')

r_gases = ThermalResistance("Флоат-ст2 Стекло, Воздух, Стекло,    SF6, Стекло,     Ar, Стекло,     Kr, Стекло", loc,# Свойства газов https://www.oknakomforta.ru/articles/poleznoe-ob-oknakh/raznovidnosti-steklopaketov-i-ikh-osobennosti/
                                      [0.0032,   0.12, 0.0032,   0.12, 0.0032,   0.12, 0.0032,   0.12, 0.0032], #δ_m, м  Воздух; SF6 - Гексафторид серы; Ar - Аргон; Kr - Криптон;
                                      [  0.76,  2.496,   0.76,  1.275,   0.76,  1.684,   0.76,  0.900,   0.76], #λ_m, Вт * м⁻¹ * ℃⁻¹
                                      [  0.84,  1.008,   0.84,  0.614,   0.84,  0.519,   0.84,  0.245,   0.84], #c_m, кДж * кг⁻¹ * ℃⁻¹ #!!! 
                                      [  2500,  1.232,   2500,  6.360,   2500,  1.699,   2500,  3.560,   2500], #ρ_m, кг * м⁻³ #!!! 
                                      внутри = "окно", снаружи = "поверхность_соприкасающаяся_непосредственно_с_наружным_воздухом")

##print("---- Отладка модуля BuildingsTypes ---")
##print(str(r_conc_sht.name) + "\tД_огр=\t" + str(r_conc_sht.Д_огр()) + "\tR=\t" + str(r_conc_sht.R()) + "\tЦ_m=\t" + str(r_conc_sht.Удельная_стоимость()))
##print(str(r_srub_kirpich.name) + "\tД_огр=\t" + str(r_srub_kirpich.Д_огр()) + "\tR=\t" + str(r_srub_kirpich.R()))
##print(str(r_pbet_mvata.name) + "\tД_огр=\t" + str(r_pbet_mvata.Д_огр()) + "\tR=\t" + str(r_pbet_mvata.R()))
##print(str(r_float_st1.name) + "\tД_огр=\t" + str(r_float_st1.Д_огр()) + "\tR=\t" + str(r_float_st1.R()) + "\tЦ_m=\t" + str(r_float_st1.Удельная_стоимость()))
##print(str(r_float_st2.name) + "\tД_огр=\t" + str(r_float_st2.Д_огр()) + "\tR=\t" + str(r_float_st2.R()) + "\tЦ_m=\t" + str(r_float_st2.Удельная_стоимость()))
##print(str(r_polycarbon10.name) + "\tД_огр=\t" + str(r_polycarbon10.Д_огр()) + "\tR=\t" + str(r_polycarbon10.R()))
