#Пример выполнения задания на КМ-3, расчет тепловых потерь за счет теплопроводности
#Импорт классов и методов
from LocalisationData import Localisation

#Локализация проекта
loc = Localisation()

#Импортирую материалы
from Matherials import r_conc_sht, r_floor_CARBON_ECO, r_float_st2

from exoheat import WallInfiltration
print(help(WallInfiltration))

H_зд = 3.1#м, высота отапливаемой части здания
l_ш = 9.5#м, ширина фасада
l_д = 11#м, длинна дома
h_цнс = 0.55#м - высота цокольного этажа(подвала) от уровня земли;
h_oнн = 0.95#м - высота от пола до подоконника;
h_oнв = 1.4#высоты окон;
l_oc = 1.3#м - ширина окон;
H_здк = H_зд + h_цнс + H_зд#м, высота здания от земли до конька
F_ф = H_зд * l_ш#площадь фасада дома
F_б = H_зд * l_д#площадь боковой стены дома
F_п = l_ш * l_д#площаь пола и потолка

ip_st_N = WallInfiltration("Ип ст:Северная", loc, r_conc_sht,#Ип-инфильтрация под окном
                           ограждение='стена_непроизводственного_здания',
                           ориентир_потерь='С', H=H_здк,
                           h_нс=h_цнс, h_нн=0, h_нв=h_oнн, l_c=l_ш)
im_st_N = WallInfiltration("Им ст:Северная", loc, r_conc_sht,#Им-инфильтрация между окнами
                           ограждение='стена_непроизводственного_здания',
                           ориентир_потерь='С', H=H_здк,
                           h_нс=h_цнс, h_нн=h_oнн, h_нв=h_oнн + h_oнв, l_c=l_ш-l_oc)#за вычетом ширины окна
in_st_N = WallInfiltration("Ин ст:Северная", loc, r_conc_sht,#Ин-инфильтрация над окном
                           ограждение='стена_непроизводственного_здания',
                           ориентир_потерь='С', H=H_здк,
                           h_нс=h_цнс, h_нн=h_oнн + h_oнв, h_нв=H_зд, l_c=l_ш)
im_ok_N = WallInfiltration("Им ок:Северная", loc, r_conc_sht,#Им-инфильтрация через окна
                           ограждение='окно_или_балконная_дверь_с_тройными_переплетами_из_пластика',
                           ориентир_потерь='С', H=H_здк,
                           h_нс=h_цнс, h_нн=h_oнн, h_нв=h_oнн + h_oнв, l_c=l_oc)

print("Q_ " + ip_st_N.name + " = " + str(round(ip_st_N.Q_losses(), 5)) + " кВт")
print("Q_ " + im_st_N.name + " = " + str(round(im_st_N.Q_losses(), 5)) + " кВт")
print("Q_ " + in_st_N.name + " = " + str(round(in_st_N.Q_losses(), 5)) + " кВт")
print("Q_ " + im_ok_N.name + " = " + str(round(im_ok_N.Q_losses(), 5)) + " кВт")

im_so_N = WallInfiltration("Им що:Северное", loc, r_float_st2,#Им-инфильтрация через щели окна
                           ограждение='стык_панелей_непроизводственного_здания',
                           ориентир_потерь='С', H=H_здк,
                           h_нс=h_цнс,
                           h_нн=[h_oнн        , h_oнн        , h_oнн, h_oнн + h_oнв],
                           h_нв=[h_oнн + h_oнв, h_oнн + h_oнв, 0    , 0            ],
                           l_c= [h_oнв        , h_oнв        , l_oc , l_oc         ])
print("Q_ " + im_so_N.name + " = " + str(round(im_so_N.Q_losses(), 5)) + " кВт")















